Pandas

In [5]:
import pandas as pd

In [6]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [7]:
pd.Series(['A', 'B', 'C'])

0    A
1    B
2    C
dtype: object

In [8]:
series1=pd.Series({'Pname': 'Shashank', 'Mobile':'841512151'})

In [9]:
series1.index

Index(['Pname', 'Mobile'], dtype='object')

Indexes for Series

In [10]:
n = pd.Series([10,20,30,40,50], index=['A','B',"C",'D','E'])
n

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [11]:
n['D']

40

Updating the Series

In [12]:
n['D']=500

In [13]:
series1.max()

'Shashank'

In [14]:
series1.min()

'841512151'

In [15]:
n.idxmax()

'D'

DATA FRAME : Combination of of several Individual series

In [16]:
df=pd.DataFrame({'ProductId': [10,20,30,40],'Pname': ['A', 'B','C','D']})
df

   ProductId Pname
0         10     A
1         20     B
2         30     C
3         40     D

In [17]:
pid = pd.Series([10,20,30])
pname = pd.Series(['A','B','C'])

ind=['ProductA','ProductB','ProductC']

df = pd.DataFrame({'PId':pid,'PName':pname})
df

   PId PName
0   10     A
1   20     B
2   30     C

Changing Column name

In [18]:
df.columns= ['Id', 'Name']
df.columns

Index(['Id', 'Name'], dtype='object')

Changing Index Names

In [19]:
df.index= ind
df

          Id Name
ProductA  10    A
ProductB  20    B
ProductC  30    C

Creating DF with Indexes & Column names

In [20]:
pd.DataFrame([['P1',999],['P2',6541]], index=['A','B'], columns=['Id','Price'])

   Id  Price
A  P1    999
B  P2   6541

Movie Lens Dataset : Pandas

In [21]:
df = pd.read_csv('ratings.csv', usecols=['userId']).squeeze()
type(df)
df

FileNotFoundError: [Errno 2] No such file or directory: 'ratings.csv'

In [ ]:
df = pd.read_csv('ratings.csv', usecols=['userId','movieId']).squeeze()
type(df)

pandas.core.frame.DataFrame

Datasets : PokemonDataSet

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\pokemon_data.csv')
df.head()

      Pokemon   Type
0   Bulbasaur  Grass
1     Ivysaur  Grass
2    Venusaur  Grass
3  Charmander   Fire
4  Charmeleon   Fire

In [ ]:
pokemonSeries = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\pokemon_data.csv', usecols=['Pokemon']).squeeze()
pokemonSeries.head()

0     Bulbasaur
1       Ivysaur
2      Venusaur
3    Charmander
4    Charmeleon
Name: Pokemon, dtype: object

In [ ]:
print('length',len(pokemonSeries))
print('Max:',max(pokemonSeries))
print('Min:',min(pokemonSeries))

length 721
Max: Zygarde
Min: Abomasnow

In [ ]:
type(sorted(pokemonSeries))

list

Series to Dictionary

In [ ]:
pokDict= dict (pokemonSeries)

In [ ]:
pokDict

{0: 'Bulbasaur',
 1: 'Ivysaur',
 2: 'Venusaur',
 3: 'Charmander',
 4: 'Charmeleon',
 5: 'Charizard',
 6: 'Squirtle',
 7: 'Wartortle',
 8: 'Blastoise',
 9: 'Caterpie',
 10: 'Metapod',
 11: 'Butterfree',
 12: 'Weedle',
 13: 'Kakuna',
 14: 'Beedrill',
 15: 'Pidgey',
 16: 'Pidgeotto',
 17: 'Pidgeot',
 18: 'Rattata',
 19: 'Raticate',
 20: 'Spearow',
 21: 'Fearow',
 22: 'Ekans',
 23: 'Arbok',
 24: 'Pikachu',
 25: 'Raichu',
 26: 'Sandshrew',
 27: 'Sandslash',
 28: 'Nidoran',
 29: 'Nidorina',
 30: 'Nidoqueen',
 31: 'Nidoran♂',
 32: 'Nidorino',
 33: 'Nidoking',
 34: 'Clefairy',
 35: 'Clefable',
 36: 'Vulpix',
 37: 'Ninetales',
 38: 'Jigglypuff',
 39: 'Wigglytuff',
 40: 'Zubat',
 41: 'Golbat',
 42: 'Oddish',
 43: 'Gloom',
 44: 'Vileplume',
 45: 'Paras',
 46: 'Parasect',
 47: 'Venonat',
 48: 'Venomoth',
 49: 'Diglett',
 50: 'Dugtrio',
 51: 'Meowth',
 52: 'Persian',
 53: 'Psyduck',
 54: 'Golduck',
 55: 'Mankey',
 56: 'Primeape',
 57: 'Growlithe',
 58: 'Arcanine',
 59: 'Poliwag',
 60: 'Poliwhirl',
 61: 'Poliwrath',
 62: 'Abra',
 63: 'Kadabra',
 64: 'Alakazam',
 65: 'Machop',
 66: 'Machoke',
 67: 'Machamp',
 68: 'Bellsprout',
 69: 'Weepinbell',
 70: 'Victreebel',
 71: 'Tentacool',
 72: 'Tentacruel',
 73: 'Geodude',
 74: 'Graveler',
 75: 'Golem',
 76: 'Ponyta',
 77: 'Rapidash',
 78: 'Slowpoke',
 79: 'Slowbro',
 80: 'Magnemite',
 81: 'Magneton',
 82: "Farfetch'd",
 83: 'Doduo',
 84: 'Dodrio',
 85: 'Seel',
 86: 'Dewgong',
 87: 'Grimer',
 88: 'Muk',
 89: 'Shellder',
 90: 'Cloyster',
 91: 'Gastly',
 92: 'Haunter',
 93: 'Gengar',
 94: 'Onix',
 95: 'Drowzee',
 96: 'Hypno',
 97: 'Krabby',
 98: 'Kingler',
 99: 'Voltorb',
 100: 'Electrode',
 101: 'Exeggcute',
 102: 'Exeggutor',
 103: 'Cubone',
 104: 'Marowak',
 105: 'Hitmonlee',
 106: 'Hitmonchan',
 107: 'Lickitung',
 108: 'Koffing',
 109: 'Weezing',
 110: 'Rhyhorn',
 111: 'Rhydon',
 112: 'Chansey',
 113: 'Tangela',
 114: 'Kangaskhan',
 115: 'Horsea',
 116: 'Seadra',
 117: 'Goldeen',
 118: 'Seaking',
 119: 'Staryu',
 120: 'Starmie',
 121: 'Mr. Mime',
 122: 'Scyther',
 123: 'Jynx',
 124: 'Electabuzz',
 125: 'Magmar',
 126: 'Pinsir',
 127: 'Tauros',
 128: 'Magikarp',
 129: 'Gyarados',
 130: 'Lapras',
 131: 'Ditto',
 132: 'Eevee',
 133: 'Vaporeon',
 134: 'Jolteon',
 135: 'Flareon',
 136: 'Porygon',
 137: 'Omanyte',
 138: 'Omastar',
 139: 'Kabuto',
 140: 'Kabutops',
 141: 'Aerodactyl',
 142: 'Snorlax',
 143: 'Articuno',
 144: 'Zapdos',
 145: 'Moltres',
 146: 'Dratini',
 147: 'Dragonair',
 148: 'Dragonite',
 149: 'Mewtwo',
 150: 'Mew',
 151: 'Chikorita',
 152: 'Bayleef',
 153: 'Meganium',
 154: 'Cyndaquil',
 155: 'Quilava',
 156: 'Typhlosion',
 157: 'Totodile',
 158: 'Croconaw',
 159: 'Feraligatr',
 160: 'Sentret',
 161: 'Furret',
 162: 'Hoothoot',
 163: 'Noctowl',
 164: 'Ledyba',
 165: 'Ledian',
 166: 'Spinarak',
 167: 'Ariados',
 168: 'Crobat',
 169: 'Chinchou',
 170: 'Lanturn',
 171: 'Pichu',
 172: 'Cleffa',
 173: 'Igglybuff',
 174: 'Togepi',
 175: 'Togetic',
 176: 'Natu',
 177: 'Xatu',
 178: 'Mareep',
 179: 'Flaaffy',
 180: 'Ampharos',
 181: 'Bellossom',
 182: 'Marill',
 183: 'Azumarill',
 184: 'Sudowoodo',
 185: 'Politoed',
 186: 'Hoppip',
 187: 'Skiploom',
 188: 'Jumpluff',
 189: 'Aipom',
 190: 'Sunkern',
 191: 'Sunflora',
 192: 'Yanma',
 193: 'Wooper',
 194: 'Quagsire',
 195: 'Espeon',
 196: 'Umbreon',
 197: 'Murkrow',
 198: 'Slowking',
 199: 'Misdreavus',
 200: 'Unown',
 201: 'Wobbuffet',
 202: 'Girafarig',
 203: 'Pineco',
 204: 'Forretress',
 205: 'Dunsparce',
 206: 'Gligar',
 207: 'Steelix',
 208: 'Snubbull',
 209: 'Granbull',
 210: 'Qwilfish',
 211: 'Scizor',
 212: 'Shuckle',
 213: 'Heracross',
 214: 'Sneasel',
 215: 'Teddiursa',
 216: 'Ursaring',
 217: 'Slugma',
 218: 'Magcargo',
 219: 'Swinub',
 220: 'Piloswine',
 221: 'Corsola',
 222: 'Remoraid',
 223: 'Octillery',
 224: 'Delibird',
 225: 'Mantine',
 226: 'Skarmory',
 227: 'Houndour',
 228: 'Houndoom',
 229: 'Kingdra',
 230: 'Phanpy',
 231: 'Donphan',
 232: 'Porygon2',
 233: 'Stantler',
 234: 'Smeargle',
 235: 'Tyrogue',
 236: 'Hitmontop',
 237: 'Smoochum',
 238: 'Elekid',
 239: 'Magby',
 240: 'Miltank',
 241: 'Blissey',
 242: 'Raikou',
 243: 'Entei',
 244: 'Suicune',
 245: 'Larvitar',
 246: 'Pupitar',
 247: 'Tyranitar',
 248: 'Lugia',
 249: 'Ho-oh',
 250: 'Celebi',
 251: 'Treecko',
 252: 'Grovyle',
 253: 'Sceptile',
 254: 'Torchic',
 255: 'Combusken',
 256: 'Blaziken',
 257: 'Mudkip',
 258: 'Marshtomp',
 259: 'Swampert',
 260: 'Poochyena',
 261: 'Mightyena',
 262: 'Zigzagoon',
 263: 'Linoone',
 264: 'Wurmple',
 265: 'Silcoon',
 266: 'Beautifly',
 267: 'Cascoon',
 268: 'Dustox',
 269: 'Lotad',
 270: 'Lombre',
 271: 'Ludicolo',
 272: 'Seedot',
 273: 'Nuzleaf',
 274: 'Shiftry',
 275: 'Taillow',
 276: 'Swellow',
 277: 'Wingull',
 278: 'Pelipper',
 279: 'Ralts',
 280: 'Kirlia',
 281: 'Gardevoir',
 282: 'Surskit',
 283: 'Masquerain',
 284: 'Shroomish',
 285: 'Breloom',
 286: 'Slakoth',
 287: 'Vigoroth',
 288: 'Slaking',
 289: 'Nincada',
 290: 'Ninjask',
 291: 'Shedinja',
 292: 'Whismur',
 293: 'Loudred',
 294: 'Exploud',
 295: 'Makuhita',
 296: 'Hariyama',
 297: 'Azurill',
 298: 'Nosepass',
 299: 'Skitty',
 300: 'Delcatty',
 301: 'Sableye',
 302: 'Mawile',
 303: 'Aron',
 304: 'Lairon',
 305: 'Aggron',
 306: 'Meditite',
 307: 'Medicham',
 308: 'Electrike',
 309: 'Manectric',
 310: 'Plusle',
 311: 'Minun',
 312: 'Volbeat',
 313: 'Illumise',
 314: 'Roselia',
 315: 'Gulpin',
 316: 'Swalot',
 317: 'Carvanha',
 318: 'Sharpedo',
 319: 'Wailmer',
 320: 'Wailord',
 321: 'Numel',
 322: 'Camerupt',
 323: 'Torkoal',
 324: 'Spoink',
 325: 'Grumpig',
 326: 'Spinda',
 327: 'Trapinch',
 328: 'Vibrava',
 329: 'Flygon',
 330: 'Cacnea',
 331: 'Cacturne',
 332: 'Swablu',
 333: 'Altaria',
 334: 'Zangoose',
 335: 'Seviper',
 336: 'Lunatone',
 337: 'Solrock',
 338: 'Barboach',
 339: 'Whiscash',
 340: 'Corphish',
 341: 'Crawdaunt',
 342: 'Baltoy',
 343: 'Claydol',
 344: 'Lileep',
 345: 'Cradily',
 346: 'Anorith',
 347: 'Armaldo',
 348: 'Feebas',
 349: 'Milotic',
 350: 'Castform',
 351: 'Kecleon',
 352: 'Shuppet',
 353: 'Banette',
 354: 'Duskull',
 355: 'Dusclops',
 356: 'Tropius',
 357: 'Chimecho',
 358: 'Absol',
 359: 'Wynaut',
 360: 'Snorunt',
 361: 'Glalie',
 362: 'Spheal',
 363: 'Sealeo',
 364: 'Walrein',
 365: 'Clamperl',
 366: 'Huntail',
 367: 'Gorebyss',
 368: 'Relicanth',
 369: 'Luvdisc',
 370: 'Bagon',
 371: 'Shelgon',
 372: 'Salamence',
 373: 'Beldum',
 374: 'Metang',
 375: 'Metagross',
 376: 'Regirock',
 377: 'Regice',
 378: 'Registeel',
 379: 'Latias',
 380: 'Latios',
 381: 'Kyogre',
 382: 'Groudon',
 383: 'Rayquaza',
 384: 'Jirachi',
 385: 'Deoxys',
 386: 'Turtwig',
 387: 'Grotle',
 388: 'Torterra',
 389: 'Chimchar',
 390: 'Monferno',
 391: 'Infernape',
 392: 'Piplup',
 393: 'Prinplup',
 394: 'Empoleon',
 395: 'Starly',
 396: 'Staravia',
 397: 'Staraptor',
 398: 'Bidoof',
 399: 'Bibarel',
 400: 'Kricketot',
 401: 'Kricketune',
 402: 'Shinx',
 403: 'Luxio',
 404: 'Luxray',
 405: 'Budew',
 406: 'Roserade',
 407: 'Cranidos',
 408: 'Rampardos',
 409: 'Shieldon',
 410: 'Bastiodon',
 411: 'Burmy',
 412: 'Wormadam',
 413: 'Mothim',
 414: 'Combee',
 415: 'Vespiquen',
 416: 'Pachirisu',
 417: 'Buizel',
 418: 'Floatzel',
 419: 'Cherubi',
 420: 'Cherrim',
 421: 'Shellos',
 422: 'Gastrodon',
 423: 'Ambipom',
 424: 'Drifloon',
 425: 'Drifblim',
 426: 'Buneary',
 427: 'Lopunny',
 428: 'Mismagius',
 429: 'Honchkrow',
 430: 'Glameow',
 431: 'Purugly',
 432: 'Chingling',
 433: 'Stunky',
 434: 'Skuntank',
 435: 'Bronzor',
 436: 'Bronzong',
 437: 'Bonsly',
 438: 'Mime Jr.',
 439: 'Happiny',
 440: 'Chatot',
 441: 'Spiritomb',
 442: 'Gible',
 443: 'Gabite',
 444: 'Garchomp',
 445: 'Munchlax',
 446: 'Riolu',
 447: 'Lucario',
 448: 'Hippopotas',
 449: 'Hippowdon',
 450: 'Skorupi',
 451: 'Drapion',
 452: 'Croagunk',
 453: 'Toxicroak',
 454: 'Carnivine',
 455: 'Finneon',
 456: 'Lumineon',
 457: 'Mantyke',
 458: 'Snover',
 459: 'Abomasnow',
 460: 'Weavile',
 461: 'Magnezone',
 462: 'Lickilicky',
 463: 'Rhyperior',
 464: 'Tangrowth',
 465: 'Electivire',
 466: 'Magmortar',
 467: 'Togekiss',
 468: 'Yanmega',
 469: 'Leafeon',
 470: 'Glaceon',
 471: 'Gliscor',
 472: 'Mamoswine',
 473: 'Porygon-Z',
 474: 'Gallade',
 475: 'Probopass',
 476: 'Dusknoir',
 477: 'Froslass',
 478: 'Rotom',
 479: 'Uxie',
 480: 'Mesprit',
 481: 'Azelf',
 482: 'Dialga',
 483: 'Palkia',
 484: 'Heatran',
 485: 'Regigigas',
 486: 'Giratina',
 487: 'Cresselia',
 488: 'Phione',
 489: 'Manaphy',
 490: 'Darkrai',
 491: 'Shaymin',
 492: 'Arceus',
 493: 'Victini',
 494: 'Snivy',
 495: 'Servine',
 496: 'Serperior',
 497: 'Tepig',
 498: 'Pignite',
 499: 'Emboar',
 500: 'Oshawott',
 501: 'Dewott',
 502: 'Samurott',
 503: 'Patrat',
 504: 'Watchog',
 505: 'Lillipup',
 506: 'Herdier',
 507: 'Stoutland',
 508: 'Purrloin',
 509: 'Liepard',
 510: 'Pansage',
 511: 'Simisage',
 512: 'Pansear',
 513: 'Simisear',
 514: 'Panpour',
 515: 'Simipour',
 516: 'Munna',
 517: 'Musharna',
 518: 'Pidove',
 519: 'Tranquill',
 520: 'Unfezant',
 521: 'Blitzle',
 522: 'Zebstrika',
 523: 'Roggenrola',
 524: 'Boldore',
 525: 'Gigalith',
 526: 'Woobat',
 527: 'Swoobat',
 528: 'Drilbur',
 529: 'Excadrill',
 530: 'Audino',
 531: 'Timburr',
 532: 'Gurdurr',
 533: 'Conkeldurr',
 534: 'Tympole',
 535: 'Palpitoad',
 536: 'Seismitoad',
 537: 'Throh',
 538: 'Sawk',
 539: 'Sewaddle',
 540: 'Swadloon',
 541: 'Leavanny',
 542: 'Venipede',
 543: 'Whirlipede',
 544: 'Scolipede',
 545: 'Cottonee',
 546: 'Whimsicott',
 547: 'Petilil',
 548: 'Lilligant',
 549: 'Basculin',
 550: 'Sandile',
 551: 'Krokorok',
 552: 'Krookodile',
 553: 'Darumaka',
 554: 'Darmanitan',
 555: 'Maractus',
 556: 'Dwebble',
 557: 'Crustle',
 558: 'Scraggy',
 559: 'Scrafty',
 560: 'Sigilyph',
 561: 'Yamask',
 562: 'Cofagrigus',
 563: 'Tirtouga',
 564: 'Carracosta',
 565: 'Archen',
 566: 'Archeops',
 567: 'Trubbish',
 568: 'Garbodor',
 569: 'Zorua',
 570: 'Zoroark',
 571: 'Minccino',
 572: 'Cinccino',
 573: 'Gothita',
 574: 'Gothorita',
 575: 'Gothitelle',
 576: 'Solosis',
 577: 'Duosion',
 578: 'Reuniclus',
 579: 'Ducklett',
 580: 'Swanna',
 581: 'Vanillite',
 582: 'Vanillish',
 583: 'Vanilluxe',
 584: 'Deerling',
 585: 'Sawsbuck',
 586: 'Emolga',
 587: 'Karrablast',
 588: 'Escavalier',
 589: 'Foongus',
 590: 'Amoonguss',
 591: 'Frillish',
 592: 'Jellicent',
 593: 'Alomomola',
 594: 'Joltik',
 595: 'Galvantula',
 596: 'Ferroseed',
 597: 'Ferrothorn',
 598: 'Klink',
 599: 'Klang',
 600: 'Klinklang',
 601: 'Tynamo',
 602: 'Eelektrik',
 603: 'Eelektross',
 604: 'Elgyem',
 605: 'Beheeyem',
 606: 'Litwick',
 607: 'Lampent',
 608: 'Chandelure',
 609: 'Axew',
 610: 'Fraxure',
 611: 'Haxorus',
 612: 'Cubchoo',
 613: 'Beartic',
 614: 'Cryogonal',
 615: 'Shelmet',
 616: 'Accelgor',
 617: 'Stunfisk',
 618: 'Mienfoo',
 619: 'Mienshao',
 620: 'Druddigon',
 621: 'Golett',
 622: 'Golurk',
 623: 'Pawniard',
 624: 'Bisharp',
 625: 'Bouffalant',
 626: 'Rufflet',
 627: 'Braviary',
 628: 'Vullaby',
 629: 'Mandibuzz',
 630: 'Heatmor',
 631: 'Durant',
 632: 'Deino',
 633: 'Zweilous',
 634: 'Hydreigon',
 635: 'Larvesta',
 636: 'Volcarona',
 637: 'Cobalion',
 638: 'Terrakion',
 639: 'Virizion',
 640: 'Tornadus',
 641: 'Thundurus',
 642: 'Reshiram',
 643: 'Zekrom',
 644: 'Landorus',
 645: 'Kyurem',
 646: 'Keldeo',
 647: 'Meloetta',
 648: 'Genesect',
 649: 'Chespin',
 650: 'Quilladin',
 651: 'Chesnaught',
 652: 'Fennekin',
 653: 'Braixen',
 654: 'Delphox',
 655: 'Froakie',
 656: 'Frogadier',
 657: 'Greninja',
 658: 'Bunnelby',
 659: 'Diggersby',
 660: 'Fletchling',
 661: 'Fletchinder',
 662: 'Talonflame',
 663: 'Scatterbug',
 664: 'Spewpa',
 665: 'Vivillon',
 666: 'Litleo',
 667: 'Pyroar',
 668: 'Flabébé',
 669: 'Floette',
 670: 'Florges',
 671: 'Skiddo',
 672: 'Gogoat',
 673: 'Pancham',
 674: 'Pangoro',
 675: 'Furfrou',
 676: 'Espurr',
 677: 'Meowstic',
 678: 'Honedge',
 679: 'Doublade',
 680: 'Aegislash',
 681: 'Spritzee',
 682: 'Aromatisse',
 683: 'Swirlix',
 684: 'Slurpuff',
 685: 'Inkay',
 686: 'Malamar',
 687: 'Binacle',
 688: 'Barbaracle',
 689: 'Skrelp',
 690: 'Dragalge',
 691: 'Clauncher',
 692: 'Clawitzer',
 693: 'Helioptile',
 694: 'Heliolisk',
 695: 'Tyrunt',
 696: 'Tyrantrum',
 697: 'Amaura',
 698: 'Aurorus',
 699: 'Sylveon',
 700: 'Hawlucha',
 701: 'Dedenne',
 702: 'Carbink',
 703: 'Goomy',
 704: 'Sliggoo',
 705: 'Goodra',
 706: 'Klefki',
 707: 'Phantump',
 708: 'Trevenant',
 709: 'Pumpkaboo',
 710: 'Gourgeist',
 711: 'Bergmite',
 712: 'Avalugg',
 713: 'Noibat',
 714: 'Noivern',
 715: 'Xerneas',
 716: 'Yveltal',
 717: 'Zygarde',
 718: 'Diancie',
 719: 'Hoopa',
 720: 'Volcanion'}

Sorting

In [ ]:
pokemonSeries.sort_values(ignore_index=True,ascending=False,).head(7)

0      Zygarde
1     Zweilous
2        Zubat
3        Zorua
4      Zoroark
5    Zigzagoon
6       Zekrom
Name: Pokemon, dtype: object

Pokemon as Index

In [ ]:
typeSeries = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\pokemon_data.csv',index_col=['Pokemon']).squeeze()
typeSeries

Pokemon
Bulbasaur       Grass
Ivysaur         Grass
Venusaur        Grass
Charmander       Fire
Charmeleon       Fire
               ...
Yveltal          Dark
Zygarde        Dragon
Diancie          Rock
Hoopa         Psychic
Volcanion        Fire
Name: Type, Length: 721, dtype: object

Row Label Indexing

In [ ]:
typeSeries.sort_index()

Pokemon
Abomasnow      Grass
Abra         Psychic
Absol           Dark
Accelgor         Bug
Aegislash      Steel
              ...
Zoroark         Dark
Zorua           Dark
Zubat         Poison
Zweilous        Dark
Zygarde       Dragon
Name: Type, Length: 721, dtype: object

In [ ]:
for i,v in enumerate(typeSeries):
    print(i,v)

0 Grass
1 Grass
2 Grass
3 Fire
4 Fire
5 Fire
6 Water
7 Water
8 Water
9 Bug
10 Bug
11 Bug
12 Bug
13 Bug
14 Bug
15 Normal
16 Normal
17 Normal
18 Normal
19 Normal
20 Normal
21 Normal
22 Poison
23 Poison
24 Electric
25 Electric
26 Ground
27 Ground
28 Poison
29 Poison
30 Poison
31 Poison
32 Poison
33 Poison
34 Fairy
35 Fairy
36 Fire
37 Fire
38 Normal
39 Normal
40 Poison
41 Poison
42 Grass
43 Grass
44 Grass
45 Bug
46 Bug
47 Bug
48 Bug
49 Ground
50 Ground
51 Normal
52 Normal
53 Water
54 Water
55 Fighting
56 Fighting
57 Fire
58 Fire
59 Water
60 Water
61 Water
62 Psychic
63 Psychic
64 Psychic
65 Fighting
66 Fighting
67 Fighting
68 Grass
69 Grass
70 Grass
71 Water
72 Water
73 Rock
74 Rock
75 Rock
76 Fire
77 Fire
78 Water
79 Water
80 Electric
81 Electric
82 Normal
83 Normal
84 Normal
85 Water
86 Water
87 Poison
88 Poison
89 Water
90 Water
91 Ghost
92 Ghost
93 Ghost
94 Rock
95 Psychic
96 Psychic
97 Water
98 Water
99 Electric
100 Electric
101 Grass
102 Grass
103 Ground
104 Ground
105 Fighting
106 Fighting
107 Normal
108 Poison
109 Poison
110 Ground
111 Ground
112 Normal
113 Grass
114 Normal
115 Water
116 Water
117 Water
118 Water
119 Water
120 Water
121 Psychic
122 Bug
123 Ice
124 Electric
125 Fire
126 Bug
127 Normal
128 Water
129 Water
130 Water
131 Normal
132 Normal
133 Water
134 Electric
135 Fire
136 Normal
137 Rock
138 Rock
139 Rock
140 Rock
141 Rock
142 Normal
143 Ice
144 Electric
145 Fire
146 Dragon
147 Dragon
148 Dragon
149 Psychic
150 Psychic
151 Grass
152 Grass
153 Grass
154 Fire
155 Fire
156 Fire
157 Water
158 Water
159 Water
160 Normal
161 Normal
162 Normal
163 Normal
164 Bug
165 Bug
166 Bug
167 Bug
168 Poison
169 Water
170 Water
171 Electric
172 Fairy
173 Normal
174 Fairy
175 Fairy
176 Psychic
177 Psychic
178 Electric
179 Electric
180 Electric
181 Grass
182 Water
183 Water
184 Rock
185 Water
186 Grass
187 Grass
188 Grass
189 Normal
190 Grass
191 Grass
192 Bug
193 Water
194 Water
195 Psychic
196 Dark
197 Dark
198 Water
199 Ghost
200 Psychic
201 Psychic
202 Normal
203 Bug
204 Bug
205 Normal
206 Ground
207 Steel
208 Fairy
209 Fairy
210 Water
211 Bug
212 Bug
213 Bug
214 Dark
215 Normal
216 Normal
217 Fire
218 Fire
219 Ice
220 Ice
221 Water
222 Water
223 Water
224 Ice
225 Water
226 Steel
227 Dark
228 Dark
229 Water
230 Ground
231 Ground
232 Normal
233 Normal
234 Normal
235 Fighting
236 Fighting
237 Ice
238 Electric
239 Fire
240 Normal
241 Normal
242 Electric
243 Fire
244 Water
245 Rock
246 Rock
247 Rock
248 Psychic
249 Fire
250 Psychic
251 Grass
252 Grass
253 Grass
254 Fire
255 Fire
256 Fire
257 Water
258 Water
259 Water
260 Dark
261 Dark
262 Normal
263 Normal
264 Bug
265 Bug
266 Bug
267 Bug
268 Bug
269 Water
270 Water
271 Water
272 Grass
273 Grass
274 Grass
275 Normal
276 Normal
277 Water
278 Water
279 Psychic
280 Psychic
281 Psychic
282 Bug
283 Bug
284 Grass
285 Grass
286 Normal
287 Normal
288 Normal
289 Bug
290 Bug
291 Bug
292 Normal
293 Normal
294 Normal
295 Fighting
296 Fighting
297 Normal
298 Rock
299 Normal
300 Normal
301 Dark
302 Steel
303 Steel
304 Steel
305 Steel
306 Fighting
307 Fighting
308 Electric
309 Electric
310 Electric
311 Electric
312 Bug
313 Bug
314 Grass
315 Poison
316 Poison
317 Water
318 Water
319 Water
320 Water
321 Fire
322 Fire
323 Fire
324 Psychic
325 Psychic
326 Normal
327 Ground
328 Ground
329 Ground
330 Grass
331 Grass
332 Normal
333 Dragon
334 Normal
335 Poison
336 Rock
337 Rock
338 Water
339 Water
340 Water
341 Water
342 Ground
343 Ground
344 Rock
345 Rock
346 Rock
347 Rock
348 Water
349 Water
350 Normal
351 Normal
352 Ghost
353 Ghost
354 Ghost
355 Ghost
356 Grass
357 Psychic
358 Dark
359 Psychic
360 Ice
361 Ice
362 Ice
363 Ice
364 Ice
365 Water
366 Water
367 Water
368 Water
369 Water
370 Dragon
371 Dragon
372 Dragon
373 Steel
374 Steel
375 Steel
376 Rock
377 Ice
378 Steel
379 Dragon
380 Dragon
381 Water
382 Ground
383 Dragon
384 Steel
385 Psychic
386 Grass
387 Grass
388 Grass
389 Fire
390 Fire
391 Fire
392 Water
393 Water
394 Water
395 Normal
396 Normal
397 Normal
398 Normal
399 Normal
400 Bug
401 Bug
402 Electric
403 Electric
404 Electric
405 Grass
406 Grass
407 Rock
408 Rock
409 Rock
410 Rock
411 Bug
412 Bug
413 Bug
414 Bug
415 Bug
416 Electric
417 Water
418 Water
419 Grass
420 Grass
421 Water
422 Water
423 Normal
424 Ghost
425 Ghost
426 Normal
427 Normal
428 Ghost
429 Dark
430 Normal
431 Normal
432 Psychic
433 Poison
434 Poison
435 Steel
436 Steel
437 Rock
438 Psychic
439 Normal
440 Normal
441 Ghost
442 Dragon
443 Dragon
444 Dragon
445 Normal
446 Fighting
447 Fighting
448 Ground
449 Ground
450 Poison
451 Poison
452 Poison
453 Poison
454 Grass
455 Water
456 Water
457 Water
458 Grass
459 Grass
460 Dark
461 Electric
462 Normal
463 Ground
464 Grass
465 Electric
466 Fire
467 Fairy
468 Bug
469 Grass
470 Ice
471 Ground
472 Ice
473 Normal
474 Psychic
475 Rock
476 Ghost
477 Ice
478 Electric
479 Psychic
480 Psychic
481 Psychic
482 Steel
483 Water
484 Fire
485 Normal
486 Ghost
487 Psychic
488 Water
489 Water
490 Dark
491 Grass
492 Normal
493 Psychic
494 Grass
495 Grass
496 Grass
497 Fire
498 Fire
499 Fire
500 Water
501 Water
502 Water
503 Normal
504 Normal
505 Normal
506 Normal
507 Normal
508 Dark
509 Dark
510 Grass
511 Grass
512 Fire
513 Fire
514 Water
515 Water
516 Psychic
517 Psychic
518 Normal
519 Normal
520 Normal
521 Electric
522 Electric
523 Rock
524 Rock
525 Rock
526 Psychic
527 Psychic
528 Ground
529 Ground
530 Normal
531 Fighting
532 Fighting
533 Fighting
534 Water
535 Water
536 Water
537 Fighting
538 Fighting
539 Bug
540 Bug
541 Bug
542 Bug
543 Bug
544 Bug
545 Grass
546 Grass
547 Grass
548 Grass
549 Water
550 Ground
551 Ground
552 Ground
553 Fire
554 Fire
555 Grass
556 Bug
557 Bug
558 Dark
559 Dark
560 Psychic
561 Ghost
562 Ghost
563 Water
564 Water
565 Rock
566 Rock
567 Poison
568 Poison
569 Dark
570 Dark
571 Normal
572 Normal
573 Psychic
574 Psychic
575 Psychic
576 Psychic
577 Psychic
578 Psychic
579 Water
580 Water
581 Ice
582 Ice
583 Ice
584 Normal
585 Normal
586 Electric
587 Bug
588 Bug
589 Grass
590 Grass
591 Water
592 Water
593 Water
594 Bug
595 Bug
596 Grass
597 Grass
598 Steel
599 Steel
600 Steel
601 Electric
602 Electric
603 Electric
604 Psychic
605 Psychic
606 Ghost
607 Ghost
608 Ghost
609 Dragon
610 Dragon
611 Dragon
612 Ice
613 Ice
614 Ice
615 Bug
616 Bug
617 Ground
618 Fighting
619 Fighting
620 Dragon
621 Ground
622 Ground
623 Dark
624 Dark
625 Normal
626 Normal
627 Normal
628 Dark
629 Dark
630 Fire
631 Bug
632 Dark
633 Dark
634 Dark
635 Bug
636 Bug
637 Steel
638 Rock
639 Grass
640 Flying
641 Electric
642 Dragon
643 Dragon
644 Ground
645 Dragon
646 Water
647 Normal
648 Bug
649 Grass
650 Grass
651 Grass
652 Fire
653 Fire
654 Fire
655 Water
656 Water
657 Water
658 Normal
659 Normal
660 Normal
661 Fire
662 Fire
663 Bug
664 Bug
665 Bug
666 Fire
667 Fire
668 Fairy
669 Fairy
670 Fairy
671 Grass
672 Grass
673 Fighting
674 Fighting
675 Normal
676 Psychic
677 Psychic
678 Steel
679 Steel
680 Steel
681 Fairy
682 Fairy
683 Fairy
684 Fairy
685 Dark
686 Dark
687 Rock
688 Rock
689 Poison
690 Poison
691 Water
692 Water
693 Electric
694 Electric
695 Rock
696 Rock
697 Rock
698 Rock
699 Fairy
700 Fighting
701 Electric
702 Rock
703 Dragon
704 Dragon
705 Dragon
706 Steel
707 Ghost
708 Ghost
709 Ghost
710 Ghost
711 Ice
712 Ice
713 Flying
714 Flying
715 Fairy
716 Dark
717 Dragon
718 Rock
719 Psychic
720 Fire

In [ ]:
'Abra' in typeSeries.index

True

In [ ]:
pokemonSeries[0:5]

0     Bulbasaur
1       Ivysaur
2      Venusaur
3    Charmander
4    Charmeleon
Name: Pokemon, dtype: object

In [ ]:
pokemonSeries[[5,9,45]]

5     Charizard
9      Caterpie
45        Paras
Name: Pokemon, dtype: object

In [ ]:
pokemonSeries[[0,2,720]] = ['Shashank Raj','Novil', 'Ram']

In [ ]:
pokemonSeries

0      Shashank Raj
1           Ivysaur
2             Novil
3        Charmander
4        Charmeleon
           ...
716         Yveltal
717         Zygarde
718         Diancie
719           Hoopa
720             Ram
Name: Pokemon, Length: 721, dtype: object

In [ ]:
typeSeries.get([0,6,51,720],'Skipped')

Pokemon
Bulbasaur     Grass
Squirtle      Water
Meowth       Normal
Volcanion      Fire
Name: Type, dtype: object

Apply to all values

In [ ]:
typeSeries.apply(len)

Pokemon
Bulbasaur     5
Ivysaur       5
Venusaur      5
Charmander    4
Charmeleon    4
             ..
Yveltal       4
Zygarde       6
Diancie       4
Hoopa         7
Volcanion     4
Name: Type, Length: 721, dtype: int64

JamesBond Dataset

create index column with first values
apply a functionality , 
if year is from 1960 to 1975, Output: "Movie Hit"
                1975 to 2000, 'Flop'
            else 'Avg'

In [ ]:
dfJames = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\jamesbond_user.csv', index_col=['Film'])
jamesSeries = dfJames

In [ ]:
def ratings(x):
    rating = None
    if 1960<= x < 1975:
        rating='Movie Hit'
    
    elif x >1975 and x <=2000:
        rating='Movie Flop'

    else:
        rating='Movie Avg'

    return rating

jamesSeries['Year'].apply(ratings)

newdict=dict(jamesSeries['Year'].apply(ratings))

In [ ]:

dic = dict(jamesSeries['Year'].map(ratings))

In [ ]:
dic

{'Dr. No': 'Movie Hit',
 'From Russia with Love': 'Movie Hit',
 'Goldfinger': 'Movie Hit',
 'Thunderball': 'Movie Hit',
 'Casino Royale': Film
 Casino Royale    Movie Hit
 Casino Royale    Movie Avg
 Name: Year, dtype: object,
 'You Only Live Twice': 'Movie Hit',
 "On Her Majesty's Secret Service": 'Movie Hit',
 'Diamonds Are Forever': 'Movie Hit',
 'Live and Let Die': 'Movie Hit',
 'The Man with the Golden Gun': 'Movie Hit',
 'The Spy Who Loved Me': 'Movie Flop',
 'Moonraker': 'Movie Flop',
 'For Your Eyes Only': 'Movie Flop',
 'Never Say Never Again': 'Movie Flop',
 'Octopussy': 'Movie Flop',
 'A View to a Kill': 'Movie Flop',
 'The Living Daylights': 'Movie Flop',
 'Licence to Kill': 'Movie Flop',
 'GoldenEye': 'Movie Flop',
 'Tomorrow Never Dies': 'Movie Flop',
 'The World Is Not Enough': 'Movie Flop',
 'Die Another Day': 'Movie Avg',
 'Quantum of Solace': 'Movie Avg',
 'Skyfall': 'Movie Avg',
 'Spectre': 'Movie Avg'}

In [ ]:
myDict = {'Water':'Happy', 'Fire': "Angry"}

# typeSeries.map(myDict)

Tushar: DataFrame

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\pokemon_data.csv')
df

        Pokemon     Type
0     Bulbasaur    Grass
1       Ivysaur    Grass
2      Venusaur    Grass
3    Charmander     Fire
4    Charmeleon     Fire
..          ...      ...
716     Yveltal     Dark
717     Zygarde   Dragon
718     Diancie     Rock
719       Hoopa  Psychic
720   Volcanion     Fire

[721 rows x 2 columns]

In [ ]:
df.axes

[RangeIndex(start=0, stop=721, step=1),
 Index(['Pokemon', 'Type'], dtype='object')]

In [ ]:
df.columns

Index(['Pokemon', 'Type'], dtype='object')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 721 entries, 0 to 720
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Pokemon  721 non-null    object
 1   Type     721 non-null    object
dtypes: object(2)
memory usage: 11.4+ KB

Selecting specific Column

In [ ]:
df[['Pokemon','Type']]

        Pokemon     Type
0     Bulbasaur    Grass
1       Ivysaur    Grass
2      Venusaur    Grass
3    Charmander     Fire
4    Charmeleon     Fire
..          ...      ...
716     Yveltal     Dark
717     Zygarde   Dragon
718     Diancie     Rock
719       Hoopa  Psychic
720   Volcanion     Fire

[721 rows x 2 columns]

DataSet : NBA

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\NbaInfo.csv')
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [ ]:
df[['Name','Age']]

              Name   Age
0    Avery Bradley  25.0
1      Jae Crowder  25.0
2     John Holland  27.0
3      R.J. Hunter  22.0
4    Jonas Jerebko  29.0
..             ...   ...
453   Shelvin Mack  26.0
454      Raul Neto  24.0
455   Tibor Pleiss  26.0
456    Jeff Withey  26.0
457            NaN   NaN

[458 rows x 2 columns]

Inserting Column at the end of the df

In [ ]:
df['Email'] = 'user@gmail.com'
df

,Name,WeightUser,Team,Number,Position,Age,Height,Weight,College,Salary,Email
0,Avery Bradley,80,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,user@gmail.com
1,Jae Crowder,80,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,user@gmail.com
2,John Holland,80,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,user@gmail.com
3,R.J. Hunter,80,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,user@gmail.com
4,Jonas Jerebko,80,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,user@gmail.com
...,...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,80,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,user@gmail.com
454,Raul Neto,80,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,user@gmail.com
455,Tibor Pleiss,80,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,user@gmail.com
456,Jeff Withey,80,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,user@gmail.com
457,NaN,80,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,user@gmail.com

Insert at Specified position

In [ ]:
df.insert(loc=1,column='WeightUser',value=80)

ValueError: cannot insert WeightUser, already exists

In [ ]:
df

,Name,WeightUser,Team,Number,Position,Age,Height,Weight,College,Salary,Email
0,Avery Bradley,80,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,user@gmail.com
1,Jae Crowder,80,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,user@gmail.com
2,John Holland,80,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,user@gmail.com
3,R.J. Hunter,80,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,user@gmail.com
4,Jonas Jerebko,80,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,user@gmail.com
...,...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,80,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,user@gmail.com
454,Raul Neto,80,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,user@gmail.com
455,Tibor Pleiss,80,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,user@gmail.com
456,Jeff Withey,80,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,user@gmail.com
457,NaN,80,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,user@gmail.com

Adding Values

In [ ]:
df['newAge']= df['Age']+4
df

,Name,WeightUser,Team,Number,Position,Age,Height,Weight,College,Salary,Email,newAge
0,Avery Bradley,80,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,user@gmail.com,29.0
1,Jae Crowder,80,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,user@gmail.com,29.0
2,John Holland,80,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,user@gmail.com,31.0
3,R.J. Hunter,80,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,user@gmail.com,26.0
4,Jonas Jerebko,80,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,user@gmail.com,33.0
...,...,...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,80,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,user@gmail.com,30.0
454,Raul Neto,80,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,user@gmail.com,28.0
455,Tibor Pleiss,80,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,user@gmail.com,30.0
456,Jeff Withey,80,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,user@gmail.com,30.0
457,NaN,80,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,user@gmail.com,NaN

Value Counts

In [ ]:
df['Team'].value_counts()
df.value_counts(subset='Team')

df.value_counts(subset='Team',normalize=True)

Team
New Orleans Pelicans      0.041575
Memphis Grizzlies         0.039387
New York Knicks           0.035011
Milwaukee Bucks           0.035011
Atlanta Hawks             0.032823
Utah Jazz                 0.032823
Toronto Raptors           0.032823
San Antonio Spurs         0.032823
Sacramento Kings          0.032823
Portland Trail Blazers    0.032823
Phoenix Suns              0.032823
Philadelphia 76ers        0.032823
Oklahoma City Thunder     0.032823
Boston Celtics            0.032823
Miami Heat                0.032823
Los Angeles Lakers        0.032823
Los Angeles Clippers      0.032823
Indiana Pacers            0.032823
Houston Rockets           0.032823
Golden State Warriors     0.032823
Detroit Pistons           0.032823
Denver Nuggets            0.032823
Dallas Mavericks          0.032823
Cleveland Cavaliers       0.032823
Chicago Bulls             0.032823
Charlotte Hornets         0.032823
Brooklyn Nets             0.032823
Washington Wizards        0.032823
Minnesota Timberwolves    0.030635
Orlando Magic             0.030635
dtype: float64

NaaN Values

In [ ]:
df['Name'].hasnans

True

In [ ]:
df.dropna(how='all')

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,newAge
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,29.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,29.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,31.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,26.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,33.0
...,...,...,...,...,...,...,...,...,...,...
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0,24.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,30.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,28.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,30.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,30.0

In [ ]:
df.dropna(subset=['College','Salary'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,newAge
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,29.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,29.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,26.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0,25.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0,29.0
...,...,...,...,...,...,...,...,...,...,...
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0,27.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0,30.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0,24.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,30.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,30.0

In [ ]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,newAge
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,29.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,29.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,31.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,26.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,33.0
...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,30.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0,28.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0,30.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,30.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Fill Naan

In [ ]:
df['Salary'] = df['Salary'].fillna(0)

In [ ]:
df['College'] = df['College'].fillna('Futurense')
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,Futurense,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,Futurense,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,Futurense,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Futurense,0.0

Sorting

In [ ]:
df.sort_values(by=['Team','Name'], ascending=[False,True], na_position='first')

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Futurense,0.0
368,Alan Anderson,Washington Wizards,6.0,SG,33.0,6-6,220.0,Michigan State,4000000.0
369,Bradley Beal,Washington Wizards,3.0,SG,22.0,6-5,207.0,Florida,5694674.0
372,Drew Gooden,Washington Wizards,90.0,PF,34.0,6-10,250.0,Kansas,3300000.0
380,Garrett Temple,Washington Wizards,17.0,SG,30.0,6-6,195.0,LSU,1100602.0
...,...,...,...,...,...,...,...,...,...
315,Paul Millsap,Atlanta Hawks,4.0,PF,31.0,6-8,246.0,Louisiana Tech,18671659.0
320,Thabo Sefolosha,Atlanta Hawks,25.0,SF,32.0,6-7,220.0,Futurense,4000000.0
321,Tiago Splitter,Atlanta Hawks,11.0,C,31.0,6-11,245.0,Futurense,9756250.0
310,Tim Hardaway Jr.,Atlanta Hawks,10.0,SG,24.0,6-6,205.0,Michigan,1304520.0
322,Walter Tavares,Atlanta Hawks,22.0,C,24.0,7-3,260.0,Futurense,1000000.0

Type Change

In [ ]:
df['Salary'].astype(int)

0      7730337
1      6796117
2            0
3      1148640
4      5000000
        ...
453    2433333
454     900000
455    2900000
456     947276
457          0
Name: Salary, Length: 458, dtype: int32

In [ ]:
df['Age']=df['Age'].fillna(0)
df['Age'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 458 entries, 0 to 457
Series name: Age
Non-Null Count  Dtype
--------------  -----
458 non-null    float64
dtypes: float64(1)
memory usage: 3.7 KB

In [ ]:
df['Age']= df['Age'].astype(int)

In [ ]:
df['Age'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 458 entries, 0 to 457
Series name: Age
Non-Null Count  Dtype
--------------  -----
458 non-null    int32
dtypes: int32(1)
memory usage: 1.9 KB

Unique

In [ ]:
print(df['Team'].nunique())
df['Team'].unique()

30

['Boston Celtics', 'Brooklyn Nets', 'New York Knicks', 'Philadelphia 76ers', 'Toronto Raptors', ..., 'Minnesota Timberwolves', 'Oklahoma City Thunder', 'Portland Trail Blazers', 'Utah Jazz', NaN]
Length: 31
Categories (30, object): ['Atlanta Hawks', 'Boston Celtics', 'Brooklyn Nets', 'Charlotte Hornets', ..., 'San Antonio Spurs', 'Toronto Raptors', 'Utah Jazz', 'Washington Wizards']

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    category
 2   Number    457 non-null    float64
 3   Position  457 non-null    category
 4   Age       458 non-null    int32
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   458 non-null    object
 8   Salary    458 non-null    float64
dtypes: category(2), float64(3), int32(1), object(3)
memory usage: 25.8+ KB

In [ ]:
df['Team']= df['Team'].astype('category')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    category
 2   Number    457 non-null    float64
 3   Position  457 non-null    category
 4   Age       458 non-null    int32
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   458 non-null    object
 8   Salary    458 non-null    float64
dtypes: category(2), float64(3), int32(1), object(3)
memory usage: 25.8+ KB

In [ ]:
df['Position'] = df['Position'].astype('category')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    category
 2   Number    457 non-null    float64
 3   Position  457 non-null    category
 4   Age       458 non-null    int32
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   458 non-null    object
 8   Salary    458 non-null    float64
dtypes: category(2), float64(3), int32(1), object(3)
memory usage: 25.8+ KB

In [ ]:
df['Age'].nunique()

23

### Question
- index=Rank
- optimize the DF from the columns
- Calculate how many companies are present?
- Unique companies?
- Total revenue generated for energy sector?
- Total no of count of employees from technology or telecommunication sector?

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\fortune_data.csv', index_col='Rank')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Company    1000 non-null   object
 1   Sector     1000 non-null   object
 2   Industry   1000 non-null   object
 3   Location   1000 non-null   object
 4   Revenue    1000 non-null   int64
 5   Profits    1000 non-null   int64
 6   Employees  1000 non-null   int64
dtypes: int64(3), object(4)
memory usage: 62.5+ KB

In [ ]:
df.head()

,Company,Sector,Industry,Location,Revenue,Profits,Employees
Rank,,,,,,,
1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400

In [ ]:
df['Sector'] = df['Sector'].astype('category')

In [ ]:
df['Industry'] = df['Industry'].astype('category')

In [ ]:
df['Location'] = df['Location'].astype(object)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 1 to 1000
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Company    1000 non-null   object
 1   Sector     1000 non-null   category
 2   Industry   1000 non-null   category
 3   Location   1000 non-null   object
 4   Revenue    1000 non-null   int64
 5   Profits    1000 non-null   int64
 6   Employees  1000 non-null   int64
dtypes: category(2), int64(3), object(2)
memory usage: 52.2+ KB

In [ ]:
df['Company'].count()

1000

In [ ]:
df['Company'].nunique()

996

Energy Sector- Total Revenue

In [ ]:
df[df['Sector']=='Energy']['Revenue'].sum()

1517809

Count of Employees

In [ ]:
df[(df['Sector'] == 'Technology') | (df['Sector'] == 'Telecommunications')]['Employees'].sum()

4411417

In [ ]:
df[(df['Sector'] == 'Technology') | (df['Sector'] == 'Telecommunications')].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 117 entries, 3 to 990
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Company    117 non-null    object
 1   Sector     117 non-null    category
 2   Industry   117 non-null    category
 3   Location   117 non-null    object
 4   Revenue    117 non-null    int64
 5   Profits    117 non-null    int64
 6   Employees  117 non-null    int64
dtypes: category(2), int64(3), object(2)
memory usage: 9.0+ KB

New Class

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\NbaInfo.csv')
df.info()
df=df.dropna()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [ ]:
df['Rank_salary'] = df['Salary'].rank().astype(int)
df.sort_values(by='Salary', ascending=False, inplace=True)
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Rank_salary
33,Carmelo Anthony,New York Knicks,7.0,SF,32.0,6-8,240.0,Syracuse,22875000.0,364
339,Chris Bosh,Miami Heat,1.0,PF,32.0,6-11,235.0,Georgia Tech,22192730.0,363
100,Chris Paul,Los Angeles Clippers,3.0,PG,31.0,6-0,175.0,Wake Forest,21468695.0,362
414,Kevin Durant,Oklahoma City Thunder,35.0,SF,27.0,6-9,240.0,Texas,20158622.0,361
164,Derrick Rose,Chicago Bulls,1.0,PG,27.0,6-3,190.0,Memphis,20093064.0,360
...,...,...,...,...,...,...,...,...,...,...
92,Jeff Ayres,Los Angeles Clippers,19.0,PF,29.0,6-9,250.0,Arizona State,111444.0,5
175,Jordan McRae,Cleveland Cavaliers,12.0,SG,25.0,6-5,179.0,Tennessee,111196.0,4
135,Alan Williams,Phoenix Suns,15.0,C,23.0,6-8,260.0,UC Santa Barbara,83397.0,3
291,Orlando Johnson,New Orleans Pelicans,0.0,SG,27.0,6-5,220.0,UC Santa Barbara,55722.0,1
130,Phil Pressey,Phoenix Suns,25.0,PG,25.0,5-11,175.0,Missouri,55722.0,1

EmployeeInfo : Time Dataset

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\EmployeesInfo.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [ ]:
df['First Name'].hasnans
df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

Changing DataType

In [ ]:
df['Start Date'] = pd.to_datetime(df['Start Date'])

In [ ]:
df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])

In [ ]:
df['Senior Management'] = (df['Senior Management']).astype(bool)

In [ ]:
df['Team'] = (df['Team']).astype('category')

In [ ]:
df['Gender'] = (df['Gender']).astype('category')

Comparison

In [ ]:
df[df['Gender']=='Male']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2023-02-01 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2023-02-01 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2023-02-01 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2023-02-01 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2023-02-01 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2023-02-01 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2023-02-01 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2023-02-01 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2023-02-01 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2023-02-01 18:24:00,129949,10.169,True,Sales

In [ ]:
df[df['Start Date'] < '1981']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2023-02-01 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2023-02-01 01:08:00,112807,17.492,True,Human Resources
43,Marilyn,Female,1980-12-07,2023-02-01 03:16:00,73524,5.207,True,Marketing
45,Roger,Male,1980-04-17,2023-02-01 11:32:00,88010,13.886,True,Sales
49,Chris,NaN,1980-01-24,2023-02-01 12:13:00,113590,3.055,False,Sales
82,Steven,Male,1980-03-30,2023-02-01 21:20:00,35095,8.379,True,Client Services
154,Rebecca,Female,1980-11-15,2023-02-01 04:13:00,85730,5.359,True,Product
213,Evelyn,Female,1980-05-24,2023-02-01 23:10:00,81673,15.364,True,Engineering
272,Fred,Male,1980-02-20,2023-02-01 02:25:00,74129,18.225,False,Product
303,Joan,NaN,1980-07-25,2023-02-01 12:22:00,38712,3.657,False,Client Services
384,Jack,Male,1980-12-24,2023-02-01 22:58:00,106995,15.723,False,Product
423,Deborah,Female,1980-11-25,2023-02-01 04:33:00,46953,17.436,False,Client Services
499,Barbara,NaN,1980-12-10,2023-02-01 23:04:00,90187,14.764,True,Distribution
502,Sarah,Female,1980-11-03,2023-02-01 14:47:00,37259,1.763,False,Client Services
505,NaN,Male,1980-04-20,2023-02-01 13:17:00,71520,13.248,True,Engineering
549,Sara,Female,1980-02-25,2023-02-01 22:50:00,75484,3.186,False,Finance
567,NaN,Female,1980-04-01,2023-02-01 20:04:00,48141,12.605,True,NaN
569,Ruby,Female,1980-07-07,2023-02-01 03:42:00,101262,6.773,False,Client Services
588,Cynthia,Female,1980-05-23,2023-02-01 03:19:00,78226,2.419,False,Human Resources
601,Christine,NaN,1980-06-15,2023-02-01 18:00:00,50366,9.862,True,Marketing
689,Julie,NaN,1980-05-08,2023-02-01 06:31:00,50529,17.263,False,Finance
743,Steven,Male,1980-05-30,2023-02-01 20:25:00,100949,13.813,True,Human Resources
759,Ruth,Female,1980-09-02,2023-02-01 06:52:00,59678,10.895,False,Distribution
808,Julie,Female,1980-03-08,2023-02-01 05:13:00,145357,3.459,False,Engineering
818,Ann,Female,1980-10-03,2023-02-01 01:08:00,96941,10.048,True,Distribution
821,NaN,Female,1980-12-27,2023-02-01 02:27:00,80399,12.254,True,Distribution
877,NaN,Male,1980-09-05,2023-02-01 07:36:00,114896,13.823,True,Client Services
881,Ruby,Female,1980-01-28,2023-02-01 23:08:00,142868,6.318,False,Marketing
954,Joe,Male,1980-01-19,2023-02-01 16:06:00,119667,1.148,True,Finance
964,Bruce,Male,1980-05-07,2023-02-01 20:00:00,35802,12.391,True,Sales

### Q
- Filter Data, Whose firstname is 'Louise' and belongs to senior Management
- Filter Data, The no of females who has been hired after 1990
- Whose salary is from 10,000 to 20,000

In [ ]:
df[(df['First Name']== 'Louise' ) & (df['Senior Management']== True)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,1980-08-12,2023-02-01 09:01:00,63241,15.132,True,NaN
441,Louise,Female,2003-05-13,2023-02-01 09:47:00,46666,1.886,True,Business Development

In [ ]:
df[(df['Gender'] == 'Female') & (df['Start Date'] > '1990-01-01')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2023-02-01 11:17:00,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,2023-02-01 10:43:00,45906,11.598,True,Finance
8,Angela,Female,2005-11-22,2023-02-01 06:29:00,95570,18.523,True,Engineering
9,Frances,Female,2002-08-08,2023-02-01 06:51:00,139852,7.524,True,Business Development
11,Julie,Female,1997-10-26,2023-02-01 15:19:00,102508,12.637,True,Legal
...,...,...,...,...,...,...,...,...
984,Maria,Female,2011-10-15,2023-02-01 16:53:00,43455,13.040,False,Engineering
987,Gloria,Female,2014-12-08,2023-02-01 05:08:00,136709,10.331,True,Finance
988,Alice,Female,2004-10-05,2023-02-01 09:34:00,47638,11.209,False,Human Resources
991,Rose,Female,2002-08-25,2023-02-01 05:12:00,134505,11.051,True,Marketing
993,Tina,Female,1997-05-15,2023-02-01 15:53:00,56450,19.040,True,Engineering

In [ ]:
df[(df['Salary'] >=10000) & (df['Salary'] <=70000)]

df[df['Salary'].between(10000,70000)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2023-02-01 06:53:00,61933,4.170,True,NaN
6,Ruby,Female,1987-08-17,2023-02-01 16:20:00,65476,10.012,True,Product
7,NaN,Female,2015-07-20,2023-02-01 10:43:00,45906,11.598,True,Finance
10,Louise,Female,1980-08-12,2023-02-01 09:01:00,63241,15.132,True,NaN
14,Kimberly,Female,1999-01-14,2023-02-01 07:13:00,41426,14.543,True,Finance
...,...,...,...,...,...,...,...,...
988,Alice,Female,2004-10-05,2023-02-01 09:34:00,47638,11.209,False,Human Resources
989,Justin,NaN,1991-02-10,2023-02-01 16:58:00,38344,3.794,False,Legal
993,Tina,Female,1997-05-15,2023-02-01 15:53:00,56450,19.040,True,Engineering
996,Phillip,Male,1984-01-31,2023-02-01 06:30:00,42392,19.675,False,Finance
998,Larry,Male,2013-04-20,2023-02-01 16:45:00,60500,11.985,False,Business Development

*isin* Operator

In [ ]:
df['Team'].isin(['Human Resource','Legal','Product'])

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997     True
998    False
999    False
Name: Team, Length: 1000, dtype: bool

No of Null Value

In [ ]:
df['First Name'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: First Name, Length: 1000, dtype: bool

Who have a Team and belong to Female Gender

In [ ]:
df[(df['Team'].isna()) & (df['Gender'] == 'Female')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
10,Louise,Female,8/12/1980,9:01 AM,63241,15.132,True,NaN
139,NaN,Female,10/3/1990,1:08 AM,132373,10.527,NaN,NaN
382,NaN,Female,4/18/1996,3:57 PM,107024,12.182,NaN,NaN
434,Joyce,Female,2/7/1995,7:38 AM,50701,14.227,True,NaN
512,Wanda,Female,4/6/1993,3:11 AM,78883,19.695,False,NaN
567,NaN,Female,4/1/1980,8:04 PM,48141,12.605,NaN,NaN
573,Kimberly,Female,12/30/1981,4:51 AM,81800,5.435,True,NaN
626,NaN,Female,4/13/1997,8:03 AM,131755,2.930,NaN,NaN
684,Alice,Female,1/21/2016,5:07 PM,117787,10.485,False,NaN
774,NaN,Female,6/18/2000,7:36 AM,106428,10.867,NaN,NaN
794,Nicole,Female,3/1/2004,5:17 PM,44021,10.286,False,NaN
853,Mildred,Female,4/6/2007,10:06 PM,139284,11.390,True,NaN
951,NaN,Female,9/14/2010,5:19 AM,143638,9.662,NaN,NaN

In [ ]:
df[df['Team'] != 'NaN']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [ ]:
df[df['Team'].isna()].count()

First Name           34
Gender               39
Start Date           43
Last Login Time      43
Salary               43
Bonus %              43
Senior Management    34
Team                  0
dtype: int64

In [ ]:
df[df['Team'].isnull()].count()

First Name           34
Gender               39
Start Date           43
Last Login Time      43
Salary               43
Bonus %              43
Senior Management    34
Team                  0
dtype: int64

Duplicates

In [ ]:
df[df.duplicated()]

# df.duplicated(subset=['First Name'])

Empty DataFrame
Columns: [First Name, Gender, Start Date, Last Login Time, Salary, Bonus %, Senior Management, Team]
Index: []

In [ ]:
df[df.duplicated(subset=['First Name'])]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
327,Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
440,Aaron,Male,7/22/1990,2:53 PM,52119,11.343,True,Client Services
937,Aaron,NaN,1/22/1986,7:39 PM,63126,18.424,False,Client Services
141,Adam,Male,12/24/1990,8:57 PM,110194,14.727,True,Product
302,Adam,Male,7/5/2007,11:59 AM,71276,5.027,True,Human Resources
...,...,...,...,...,...,...,...,...
902,NaN,Male,5/23/2001,7:52 PM,103877,6.322,NaN,Distribution
925,NaN,Female,8/23/2000,4:19 PM,95866,19.388,NaN,Sales
946,NaN,Female,9/15/1985,1:50 AM,133472,16.941,NaN,Distribution
947,NaN,Male,7/30/2012,3:07 PM,107351,5.329,NaN,Marketing
951,NaN,Female,9/14/2010,5:19 AM,143638,9.662,NaN,NaN

In [ ]:
df.drop_duplicates(subset='First Name',keep='first')

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
137,Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution
300,Alan,Male,6/26/1988,3:54 AM,111786,3.592,True,Engineering
372,Albert,Male,2/1/1997,4:20 PM,67827,19.717,True,Engineering
988,Alice,Female,10/5/2004,9:34 AM,47638,11.209,False,Human Resources
...,...,...,...,...,...,...,...,...
433,Wanda,Female,7/20/2008,1:44 PM,65362,7.132,True,Legal
177,Wayne,Male,4/7/2012,8:00 AM,102652,14.085,True,Distribution
820,William,Male,11/18/1993,12:27 PM,54058,5.182,True,Human Resources
450,Willie,Male,8/22/2009,1:03 PM,55038,19.691,False,Legal
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance

Index

In [ ]:
dummyDf = df.set_index(['First Name'])
# dummyDf = df.set_index(['First Name', 'Gender'])
dummyDf.reset_index(drop=True,)
dummyDf

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Aaron,Male,2/17/2012,10:20 AM,61602,11.849,True,Marketing
Aaron,Male,1/29/1994,6:48 PM,58755,5.097,True,Marketing
Aaron,Male,7/22/1990,2:53 PM,52119,11.343,True,Client Services
Aaron,NaN,1/22/1986,7:39 PM,63126,18.424,False,Client Services
Adam,Male,5/21/2011,1:45 AM,95327,15.120,False,Distribution
...,...,...,...,...,...,...,...
NaN,Male,5/23/2001,7:52 PM,103877,6.322,NaN,Distribution
NaN,Female,8/23/2000,4:19 PM,95866,19.388,NaN,Sales
NaN,Female,9/15/1985,1:50 AM,133472,16.941,NaN,Distribution
NaN,Male,7/30/2012,3:07 PM,107351,5.329,NaN,Marketing
NaN,Female,9/14/2010,5:19 AM,143638,9.662,NaN,NaN

Row Label Indexing

In [ ]:
dfNba = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\NbaInfo.csv')
df=dfNba

In [ ]:
df=df.dropna()

In [ ]:
df=df.set_index('Name')

In [ ]:
df.loc['Avery Bradley']

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

In [ ]:
df.loc['Avery Bradley', 'Team']

'Boston Celtics'

In [ ]:
df.loc['Avery Bradley', 'Team': 'Age']

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Name: Avery Bradley, dtype: object

In [ ]:
df.loc['Aaron Brooks': 'Al Horford', 'Team': 'Age']

                               Team  Number Position   Age
Name
Aaron Brooks          Chicago Bulls     0.0       PG  31.0
Jimmy Butler          Chicago Bulls    21.0       SG  26.0
Mike Dunleavy         Chicago Bulls    34.0       SG  35.0
Taj Gibson            Chicago Bulls    22.0       PF  30.0
Justin Holiday        Chicago Bulls     7.0       SG  27.0
...                             ...     ...      ...   ...
David West        San Antonio Spurs    30.0       PF  35.0
Kent Bazemore         Atlanta Hawks    24.0       SF  26.0
Tim Hardaway Jr.      Atlanta Hawks    10.0       SG  24.0
Kirk Hinrich          Atlanta Hawks    12.0       SG  35.0
Al Horford            Atlanta Hawks    15.0        C  30.0

[130 rows x 4 columns]

In [ ]:
df.iloc[2,:4]

Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Name: R.J. Hunter, dtype: object

Drop

In [ ]:
# df.drop('Team', axis=1)
dfTeam=df.pop('Team')

In [ ]:
# df['Team'] = dfNba['Team']

In [ ]:
df.insert(2,value=dfTeam,column='Team')

In [ ]:
df

,Number,Position,Team,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,0.0,PG,Boston Celtics,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,99.0,SF,Boston Celtics,25.0,6-6,235.0,Marquette,6796117.0
R.J. Hunter,28.0,SG,Boston Celtics,22.0,6-5,185.0,Georgia State,1148640.0
Jordan Mickey,55.0,PF,Boston Celtics,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,41.0,C,Boston Celtics,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...
Rodney Hood,5.0,SG,Utah Jazz,23.0,6-8,206.0,Duke,1348440.0
Chris Johnson,23.0,SF,Utah Jazz,26.0,6-6,206.0,Dayton,981348.0
Trey Lyles,41.0,PF,Utah Jazz,20.0,6-10,234.0,Kentucky,2239800.0
Shelvin Mack,8.0,PG,Utah Jazz,26.0,6-3,203.0,Butler,2433333.0
Jeff Withey,24.0,C,Utah Jazz,26.0,7-0,231.0,Kansas,947276.0

Sampling

In [ ]:
df.sample(frac=0.01)

,Number,Position,Team,Age,Height,Weight,College,Salary
Name,,,,,,,,
Reggie Bullock,25.0,SF,Detroit Pistons,25.0,6-7,205.0,North Carolina,1252440.0
Marreese Speights,5.0,C,Golden State Warriors,28.0,6-10,255.0,Florida,3815000.0
Ryan Kelly,4.0,PF,Los Angeles Lakers,25.0,6-11,230.0,Duke,1724250.0
Johnny O'Bryant III,77.0,PF,Milwaukee Bucks,23.0,6-9,257.0,LSU,845059.0

Greatest/Smallest

In [ ]:
df['Weight'].sort_values(ascending=False)[:3]

# df.nlargest(3,columns='Weight')

Name
Andre Drummond    279.0
Brook Lopez       275.0
Jahlil Okafor     275.0
Name: Weight, dtype: float64

In [ ]:
df.nsmallest(3,columns='Weight')

,Number,Position,Team,Age,Height,Weight,College,Salary
Name,,,,,,,,
Aaron Brooks,0.0,PG,Chicago Bulls,31.0,6-0,161.0,Oregon,2250000.0
Bryce Cotton,8.0,PG,Memphis Grizzlies,23.0,6-1,165.0,Providence,700902.0
Tim Frazier,2.0,PG,New Orleans Pelicans,25.0,6-1,170.0,Penn State,845059.0

In [ ]:
df.where(df['Age']==22)

,Number,Position,Team,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Jae Crowder,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
R.J. Hunter,28.0,SG,Boston Celtics,22.0,6-5,185.0,Georgia State,1148640.0
Jordan Mickey,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Kelly Olynyk,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
Rodney Hood,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Chris Johnson,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Trey Lyles,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Shelvin Mack,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Jeff Withey,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Column Rename

In [ ]:
#df.query("Position == 'C'")

df=df.rename(columns={'College': 'College Name'})
df

,Number,Position,Team,Age,Height,Weight,College_Name,Salary
Name,,,,,,,,
Avery Bradley,0.0,PG,Boston Celtics,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,99.0,SF,Boston Celtics,25.0,6-6,235.0,Marquette,6796117.0
R.J. Hunter,28.0,SG,Boston Celtics,22.0,6-5,185.0,Georgia State,1148640.0
Jordan Mickey,55.0,PF,Boston Celtics,21.0,6-8,235.0,LSU,1170960.0
Kelly Olynyk,41.0,C,Boston Celtics,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...
Rodney Hood,5.0,SG,Utah Jazz,23.0,6-8,206.0,Duke,1348440.0
Chris Johnson,23.0,SF,Utah Jazz,26.0,6-6,206.0,Dayton,981348.0
Trey Lyles,41.0,PF,Utah Jazz,20.0,6-10,234.0,Kentucky,2239800.0
Shelvin Mack,8.0,PG,Utah Jazz,26.0,6-3,203.0,Butler,2433333.0
Jeff Withey,24.0,C,Utah Jazz,26.0,7-0,231.0,Kansas,947276.0

In [ ]:
col=[]
for data in df.columns:
    col.append(data.replace(' ', '_'))

col

['Number',
 'Position',
 'Team',
 'Age',
 'Height',
 'Weight',
 'College_Name',
 'Salary']

In [ ]:
df.columns=[data.replace(' ', '_') for data in df.columns]

In [ ]:
df.columns

Index(['Number', 'Position', 'Team', 'Age', 'Height', 'Weight', 'College_Name',
       'Salary'],
      dtype='object')

Q. Name Age and Team

- Using Query methos, filter by age whose age is 28,21,13
- Take on the name column and append Key word, Mr/Mrs

In [ ]:
dfq = dfNba[['Name','Age','Team']]

In [ ]:
dfq.query("Age in [28,21,13]")

                        Name   Age                    Team
6              Jordan Mickey  21.0          Boston Celtics
17           Wayne Ellington  28.0           Brooklyn Nets
18   Rondae Hollis-Jefferson  21.0           Brooklyn Nets
23               Brook Lopez  28.0           Brooklyn Nets
24          Chris McCullough  21.0           Brooklyn Nets
28              Donald Sloan  28.0           Brooklyn Nets
38               Robin Lopez  28.0         New York Knicks
42              Lance Thomas  28.0         New York Knicks
80             Stephen Curry  28.0   Golden State Warriors
88         Marreese Speights  28.0   Golden State Warriors
97            Wesley Johnson  28.0    Los Angeles Clippers
115            Julius Randle  21.0      Los Angeles Lakers
123           Chase Budinger  28.0            Phoenix Suns
125           Archie Goodwin  21.0            Phoenix Suns
142          Darren Collison  28.0        Sacramento Kings
163             Bobby Portis  21.0           Chicago Bulls
193              Jodie Meeks  28.0         Detroit Pistons
201              Jordan Hill  28.0          Indiana Pacers
203                Ty Lawson  28.0          Indiana Pacers
211    Giannis Antetokounmpo  21.0         Milwaukee Bucks
215              Tyler Ennis  21.0         Milwaukee Bucks
217            Damien Inglis  21.0         Milwaukee Bucks
218                O.J. Mayo  28.0         Milwaukee Bucks
223            Jabari Parker  21.0         Milwaukee Bucks
229             Jeremy Evans  28.0        Dallas Mavericks
234             JaVale McGee  28.0        Dallas Mavericks
257             Jordan Adams  21.0       Memphis Grizzlies
262              Mike Conley  28.0       Memphis Grizzlies
273           Alex Stepheson  28.0       Memphis Grizzlies
274           Brandan Wright  28.0       Memphis Grizzlies
275            Alexis Ajinca  28.0    New Orleans Pelicans
276            Ryan Anderson  28.0    New Orleans Pelicans
293         Quincy Pondexter  28.0    New Orleans Pelicans
300              Danny Green  28.0       San Antonio Spurs
328           Aaron Harrison  21.0       Charlotte Hornets
329            Spencer Hawes  28.0       Charlotte Hornets
357            Mario Hezonja  21.0           Orlando Magic
383           Darrell Arthur  28.0          Denver Nuggets
384            D.J. Augustin  28.0          Denver Nuggets
389              Gary Harris  21.0          Denver Nuggets
390             Nikola Jokic  21.0          Denver Nuggets
395             Jusuf Nurkic  21.0          Denver Nuggets
398          Nemanja Bjelica  28.0  Minnesota Timberwolves
402              Zach LaVine  21.0  Minnesota Timberwolves
411           Andrew Wiggins  21.0  Minnesota Timberwolves
422            Cameron Payne  21.0   Oklahoma City Thunder
424             Kyle Singler  28.0   Oklahoma City Thunder
433         Gerald Henderson  28.0  Portland Trail Blazers
442            Trevor Booker  28.0               Utah Jazz
450               Joe Ingles  28.0               Utah Jazz

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\NbaInfo.csv')


# df['Name'].apply( lambda x: 'Mr/Mrs {}'.format(x))

two words in names Mr ,
3 words in names Mrs

In [ ]:
# def mrs(a):
    
#     l=len(str(a).split(' '))

#     if l==2:
#         return "Mr {}".format(a)
#     else:
#         return "Mrs {}".format(a)


df['Name'].apply( lambda x:"Mr {}".format(x) if len(str(x).split(' '))==2 else "Mrs {}".format(x))

0      Mr Avery Bradley
1        Mr Jae Crowder
2       Mr John Holland
3        Mr R.J. Hunter
4      Mr Jonas Jerebko
             ...
453     Mr Shelvin Mack
454        Mr Raul Neto
455     Mr Tibor Pleiss
456      Mr Jeff Withey
457             Mrs nan
Name: Name, Length: 458, dtype: object

In [ ]:
df['Name'].str.startswith('Mr')

0      False
1      False
2      False
3      False
4      False
       ...
453    False
454    False
455    False
456    False
457      NaN
Name: Name, Length: 458, dtype: object

Chicago City : Dataset

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\Chicago_city.csv')
df

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00
...,...,...,...,...
32058,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,$87384.00
32059,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,$84450.00
32060,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,$87384.00
32061,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,$113664.00
32062,NaN,NaN,NaN,NaN

In [ ]:
df['Name']=df['Name'].str.lower()

In [ ]:
df['Employee Annual Salary']=df['Employee Annual Salary'].str.replace('$','')

C:\Users\Miles\AppData\Local\Temp\ipykernel_3924\253300384.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Employee Annual Salary']=df['Employee Annual Salary'].str.replace('$','')

In [ ]:
df['Employee Annual Salary']= df['Employee Annual Salary'].astype('float')

In [ ]:
df['Position Title']= df['Position Title'].str.replace('-',' ').str.lower()

In [ ]:
df.set_index('Position Title')

,Name,Department,Employee Annual Salary
Position Title,,,
water rate taker,"aaron, elvia j",WATER MGMNT,90744.0
police officer,"aaron, jeffery m",POLICE,84450.0
police officer,"aaron, karina",POLICE,84450.0
chief contract expediter,"aaron, kimberlei r",GENERAL SERVICES,89880.0
civil engineer iv,"abad jr, vicente m",WATER MGMNT,106836.0
...,...,...,...
police officer,"zygowicz, peter j",POLICE,87384.0
police officer,"zymantas, mark e",POLICE,84450.0
police officer,"zyrkowski, carlo e",POLICE,87384.0
chief data base analyst,"zyskowski, dariusz",DoIT,113664.0
NaN,NaN,NaN,NaN

In [ ]:
df['Position Title'].str.split(' ').str.get(0)

0         water
1        police
2        police
3         chief
4         civil
          ...
32058    police
32059    police
32060    police
32061     chief
32062       NaN
Name: Position Title, Length: 32063, dtype: object

- Take department column, replace all the words MGMT with Management, 
- Find out those word with the keyword 'MENT' and count its occurance

In [ ]:
df['Department'].str.replace('MGMNT','MANAGEMENT').str.lower().str.endswith('ment').value_counts()

False    29931
True      2131
Name: Department, dtype: int64

In [ ]:
df.loc[df[df['College']== 'Georgia State'].index,'College'] = 'Tampa'

In [ ]:
df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Tampa,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

New Data

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\BigmacBurger_data2.csv', parse_dates=['Date'], index_col=['Date','Country'])
df

                      Price in US Dollars
Date   Country
Jan-16 Argentina                     2.39
       Australia                     3.74
       Brazil                        3.35
       Britain                       4.22
       Canada                        4.14
...                                   ...
Jan-10 UAE                           2.99
       Ukraine                       1.83
       United States                 3.58
       Uruguay                       3.32
       Urgu                          3.32

[653 rows x 1 columns]

Column Rename

In [ ]:
df.rename(mapper={'oldName': 'newName'})

                      Price in US Dollars
Date   Country
Jan-16 Argentina                     2.39
       Australia                     3.74
       Brazil                        3.35
       Britain                       4.22
       Canada                        4.14
...                                   ...
Jan-10 UAE                           2.99
       Ukraine                       1.83
       United States                 3.58
       Uruguay                       3.32
       Urgu                          3.32

[653 rows x 1 columns]

In [ ]:
# df.loc[('Jan-16','Argentina')]
df.loc[('Jan-16')].loc[('Argentina')]

Price in US Dollars    2.39
Name: Argentina, dtype: float64

In [ ]:
df.loc[('Jan-16')]['Argentina': 'Canada']

           Price in US Dollars
Country
Argentina                 2.39
Australia                 3.74
Brazil                    3.35
Britain                   4.22
Canada                    4.14

In [ ]:
df.iloc[:5,:3]

                  Price in US Dollars
Date   Country
Jan-16 Argentina                 2.39
       Australia                 3.74
       Brazil                    3.35
       Britain                   4.22
       Canada                    4.14

In [ ]:
df.index.get_level_values(1)

Index(['Argentina', 'Australia', 'Brazil', 'Britain', 'Canada', 'Chile',
       'China', 'Colombia', 'Costa Rica', 'Czech Republic',
       ...
       'Sweden', 'Switzerland', 'Taiwan', 'Thailand', 'Turkey', 'UAE',
       'Ukraine', 'United States', 'Uruguay', 'Urgu'],
      dtype='object', name='Country', length=653)

Transpose

In [ ]:
df.transpose()

Date                   Jan-16                                              \
Country             Argentina Australia Brazil Britain Canada Chile China
Price in US Dollars      2.39      3.74   3.35    4.22   4.14  2.94  2.68

Date                                                    ... Jan-10  \
Country             Colombia Costa Rica Czech Republic  ... Sweden
Price in US Dollars     2.43       4.02           2.98  ...   5.51

Date                                                                  \
Country             Switzerland Taiwan Thailand Turkey   UAE Ukraine
Price in US Dollars         6.3   2.36     2.11   3.83  2.99    1.83

Date
Country             United States Uruguay  Urgu
Price in US Dollars          3.58    3.32  3.32

[1 rows x 653 columns]

In [ ]:
# df.transpose().loc[:,('Jan-16')].loc[:,'Argentina':'Canada']
df.transpose()['Jan-16'].loc[:,'Argentina':'Canada']

Country              Argentina  Australia  Brazil  Britain  Canada
Price in US Dollars       2.39       3.74    3.35     4.22    4.14

In [ ]:
df.transpose().loc['Price in US Dollars','Jan-16'][0:5]

Country
Argentina    2.39
Australia    3.74
Brazil       3.35
Britain      4.22
Canada       4.14
Name: Price in US Dollars, dtype: float64

Change Column Names

In [ ]:
df.index.set_names(names=['Days','Values'])

MultiIndex([('Jan-16',      'Argentina'),
            ('Jan-16',      'Australia'),
            ('Jan-16',         'Brazil'),
            ('Jan-16',        'Britain'),
            ('Jan-16',         'Canada'),
            ('Jan-16',          'Chile'),
            ('Jan-16',          'China'),
            ('Jan-16',       'Colombia'),
            ('Jan-16',     'Costa Rica'),
            ('Jan-16', 'Czech Republic'),
            ...
            ('Jan-10',         'Sweden'),
            ('Jan-10',    'Switzerland'),
            ('Jan-10',         'Taiwan'),
            ('Jan-10',       'Thailand'),
            ('Jan-10',         'Turkey'),
            ('Jan-10',            'UAE'),
            ('Jan-10',        'Ukraine'),
            ('Jan-10',  'United States'),
            ('Jan-10',        'Uruguay'),
            ('Jan-10',           'Urgu')],
           names=['Days', 'Values'], length=653)

In [ ]:
df.index

MultiIndex([('Jan-16',      'Argentina'),
            ('Jan-16',      'Australia'),
            ('Jan-16',         'Brazil'),
            ('Jan-16',        'Britain'),
            ('Jan-16',         'Canada'),
            ('Jan-16',          'Chile'),
            ('Jan-16',          'China'),
            ('Jan-16',       'Colombia'),
            ('Jan-16',     'Costa Rica'),
            ('Jan-16', 'Czech Republic'),
            ...
            ('Jan-10',         'Sweden'),
            ('Jan-10',    'Switzerland'),
            ('Jan-10',         'Taiwan'),
            ('Jan-10',       'Thailand'),
            ('Jan-10',         'Turkey'),
            ('Jan-10',            'UAE'),
            ('Jan-10',        'Ukraine'),
            ('Jan-10',  'United States'),
            ('Jan-10',        'Uruguay'),
            ('Jan-10',           'Urgu')],
           names=['Date', 'Country'], length=653)

Date as Index

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\BigmacBurger_data2.csv', parse_dates=['Date'], index_col=['Date'])
df

              Country  Price in US Dollars
Date
Jan-16      Argentina                 2.39
Jan-16      Australia                 3.74
Jan-16         Brazil                 3.35
Jan-16        Britain                 4.22
Jan-16         Canada                 4.14
...               ...                  ...
Jan-10            UAE                 2.99
Jan-10        Ukraine                 1.83
Jan-10  United States                 3.58
Jan-10        Uruguay                 3.32
Jan-10           Urgu                 3.32

[653 rows x 2 columns]

Stack Methos

In [ ]:
df.stack()

# df.unstack()
df.head()

          Country  Price in US Dollars
Date
Jan-16  Argentina                 2.39
Jan-16  Australia                 3.74
Jan-16     Brazil                 3.35
Jan-16    Britain                 4.22
Jan-16     Canada                 4.14

Pivot

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\BigmacBurger_data2.csv', parse_dates=['Date'])

df.pivot(index='Date',columns=['Country'],values='Price in US Dollars')

Country,Argentina,Australia,Austria,Belgium,Brazil,Britain,Canada,Chile,China,Colombia,...,Taiwan,Thailand,Turkey,UAE,Ukraine,United States,Urgu,Uruguay,Venezuela,Vietnam
Date,,,,,,,,,,,,,,,,,,,,,
Jan-10,1.84,3.98,NaN,NaN,4.76,3.67,3.97,3.18,1.83,3.91,...,2.36,2.11,3.83,2.99,1.83,3.58,3.32,3.32,NaN,NaN
Jan-12,4.64,4.94,3.92,4.69,5.68,3.82,4.63,4.05,2.44,4.54,...,2.50,2.46,3.54,3.27,2.11,4.20,NaN,4.63,6.99,NaN
Jan-13,3.82,4.90,4.60,5.16,5.64,4.25,5.39,4.35,2.57,4.85,...,2.54,2.92,4.78,3.27,2.33,4.37,NaN,5.45,9.08,NaN
Jan-14,3.03,4.47,4.60,5.36,5.25,4.63,5.01,3.69,2.74,4.34,...,2.62,2.92,3.76,3.27,2.27,4.62,NaN,4.91,7.15,2.84
Jan-15,3.25,4.32,3.93,4.29,5.21,4.37,4.64,3.35,2.77,3.34,...,2.51,3.04,3.96,3.54,1.20,4.79,NaN,4.63,2.53,2.81
Jan-16,2.39,3.74,3.76,4.25,3.35,4.22,4.14,2.94,2.68,2.43,...,2.08,3.09,3.41,3.54,1.54,4.93,NaN,3.74,0.66,2.67
Jul-10,3.56,3.84,NaN,NaN,4.91,3.48,4.00,3.34,1.95,4.39,...,2.34,2.17,3.89,2.99,1.84,3.73,NaN,3.74,NaN,NaN
Jul-11,4.84,4.94,4.43,5.38,6.16,3.89,5.00,4.00,2.27,4.74,...,2.60,2.35,3.77,3.27,2.06,4.07,NaN,4.88,6.52,NaN
Jul-12,4.16,4.68,3.87,4.61,4.94,4.16,5.02,4.16,2.45,4.77,...,2.48,2.59,4.52,3.27,1.86,4.33,NaN,4.53,7.92,NaN
Jul-13,3.88,4.62,4.36,4.76,5.28,4.02,5.26,3.94,2.61,4.48,...,2.63,2.85,4.34,3.27,2.33,4.56,NaN,4.98,7.15,NaN
Jul-14,2.57,4.81,4.56,4.98,5.86,4.93,5.25,3.72,2.73,4.65,...,2.63,3.12,4.42,3.54,1.63,4.80,NaN,4.92,6.82,2.83
Jul-15,3.07,3.92,3.71,4.05,4.28,4.51,4.54,3.27,2.74,2.92,...,2.55,3.17,3.87,3.54,1.55,4.79,NaN,4.13,0.67,2.75

Q.
- Name as Index
- Team as Pivot Table (COlumn)
- Salary as Value

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\EmployeesInfo.csv')

# df.fillna('New', inplace=True)
df=df[~df.duplicated(subset='First Name')]

In [ ]:
# df=df.pivot(index='Team', columns='First Name', values='Salary')

df.head()

First Name,NaN,Aaron,Adam,Alan,Albert,Alice,Amanda,Amy,Andrea,Andrew,...,Timothy,Tina,Todd,Victor,Virginia,Walter,Wanda,Wayne,William,Willie
Team,,,,,,,,,,,,,,,,,,,,,
NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Business Development,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,120204.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Client Services,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,43414.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Distribution,NaN,NaN,95327.0,NaN,NaN,NaN,80803.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,102652.0,NaN,NaN
Engineering,NaN,NaN,NaN,NaN,67827.0,NaN,NaN,122897.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.transpose()

Team,NaN,Business Development,Client Services,Distribution,Engineering,Finance,Human Resources,Legal,Marketing,Product,Sales
First Name,,,,,,,,,,,
NaN,NaN,NaN,NaN,NaN,NaN,45906.0,NaN,NaN,NaN,NaN,NaN
Aaron,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,61602.0,NaN,NaN
Adam,NaN,NaN,NaN,95327.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Alan,NaN,NaN,NaN,NaN,NaN,40341.0,NaN,NaN,NaN,NaN,NaN
Albert,NaN,NaN,NaN,NaN,67827.0,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
Walter,NaN,NaN,NaN,NaN,NaN,127813.0,NaN,NaN,NaN,NaN,NaN
Wanda,NaN,NaN,NaN,NaN,NaN,NaN,NaN,65362.0,NaN,NaN,NaN
Wayne,NaN,NaN,NaN,102652.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
William,NaN,NaN,NaN,NaN,NaN,NaN,66521.0,NaN,NaN,NaN,NaN
Willie,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,64363.0,NaN,NaN

Total amount spend by Female user

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\userfoods.csv')
df.head()

  First Name  Gender          City Frequency       Item  Spend
0      Wanda  Female      Stamford    Weekly     Burger  15.66
1       Eric    Male      Stamford     Daily    Chalupa  10.56
2    Charles    Male      New York     Never      Sushi  42.14
3       Anna  Female  Philadelphia      Once  Ice Cream  11.01
4    Deborah  Female  Philadelphia     Daily    Chalupa  23.49

In [ ]:
df.pivot_table(index='Gender',values='Spend',aggfunc=sum)

           Spend
Gender
Female  25963.33
Male    24106.04

In [ ]:
df.pivot_table(index='Gender',columns=['Item'],values=['Spend'],aggfunc=sum)

          Spend
Item     Burger  Burrito  Chalupa    Donut Ice Cream    Sushi
Gender
Female  4094.30  4257.82  4152.26  4743.00   4032.87  4683.08
Male    3671.43  4012.62  3492.26  4015.76   4854.12  4059.85

In [ ]:
pdf=df.pivot_table(index=['Item'],columns='City',values=['Spend'],aggfunc=sum)
pdf

             Spend
City      New York Philadelphia Stamford
Item
Burger     2533.13      2577.42  2655.18
Burrito    2378.35      2771.69  3120.40
Chalupa    2104.35      2787.56  2752.61
Donut      2792.05      2888.62  3078.09
Ice Cream  3125.25      3670.49  2091.25
Sushi      2876.44      3138.76  2727.73

Q. Covert a Pivot Table into the DF *melt* method

In [ ]:
# pandas.melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None, sort=False)

pd.melt(pdf)

     None          City    value
0   Spend      New York  2533.13
1   Spend      New York  2378.35
2   Spend      New York  2104.35
3   Spend      New York  2792.05
4   Spend      New York  3125.25
5   Spend      New York  2876.44
6   Spend  Philadelphia  2577.42
7   Spend  Philadelphia  2771.69
8   Spend  Philadelphia  2787.56
9   Spend  Philadelphia  2888.62
10  Spend  Philadelphia  3670.49
11  Spend  Philadelphia  3138.76
12  Spend      Stamford  2655.18
13  Spend      Stamford  3120.40
14  Spend      Stamford  2752.61
15  Spend      Stamford  3078.09
16  Spend      Stamford  2091.25
17  Spend      Stamford  2727.73

Group BY

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\fortune_data.csv')
df2 = df
df.head()

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400

In [ ]:
df['Sector'].nunique()

21

In [ ]:
sectorGroups=df.groupby(by='Sector')

In [ ]:
sectorGroups.groups

{'Aerospace & Defense': [23, 44, 59, 87, 117, 119, 208, 244, 281, 377, 388, 489, 559, 604, 784, 787, 835, 902, 957, 986], 'Apparel': [90, 230, 339, 353, 447, 546, 574, 596, 682, 694, 725, 793, 876, 881, 916], 'Business Services': [143, 185, 198, 203, 220, 247, 248, 293, 306, 311, 354, 391, 403, 439, 466, 467, 480, 484, 491, 502, 544, 625, 634, 651, 676, 693, 713, 728, 733, 734, 736, 743, 766, 775, 776, 782, 790, 791, 795, 800, 802, 815, 818, 819, 868, 869, 885, 938, 950, 951, 992], 'Chemicals': [55, 100, 181, 188, 205, 252, 261, 276, 287, 295, 315, 537, 548, 554, 565, 579, 612, 623, 653, 667, 716, 719, 723, 757, 760, 828, 864, 897, 933, 948], 'Energy': [1, 13, 29, 31, 41, 64, 89, 94, 97, 103, 114, 116, 120, 161, 162, 164, 165, 174, 177, 187, 189, 191, 192, 197, 213, 215, 216, 222, 224, 228, 242, 245, 246, 256, 271, 273, 278, 288, 318, 321, 323, 342, 347, 348, 349, 362, 363, 383, 386, 387, 393, 401, 402, 409, 424, 436, 437, 444, 457, 474, 482, 492, 506, 521, 540, 547, 555, 557, 568, 570, 578, 597, 599, 605, 632, 649, 655, 661, 678, 691, 695, 702, 703, 705, 710, 714, 731, 741, 742, 744, 753, 771, 783, 797, 801, 809, 816, 825, 842, 849, ...], 'Engineering & Construction': [154, 155, 234, 259, 300, 313, 351, 380, 432, 477, 497, 500, 515, 571, 575, 639, 718, 737, 821, 862, 873, 891, 928, 962, 984, 993], 'Financials': [3, 15, 22, 25, 26, 28, 34, 39, 42, 48, 49, 60, 68, 72, 73, 75, 77, 80, 81, 82, 84, 99, 104, 111, 113, 130, 134, 136, 151, 170, 178, 183, 204, 209, 221, 225, 226, 231, 235, 249, 251, 258, 263, 264, 270, 272, 274, 282, 297, 305, 310, 317, 325, 328, 331, 343, 346, 366, 367, 375, 381, 397, 400, 410, 420, 435, 441, 448, 452, 453, 470, 471, 472, 475, 478, 481, 485, 487, 493, 496, 498, 505, 508, 509, 519, 528, 530, 535, 539, 550, 560, 567, 572, 589, 602, 608, 610, 645, 650, 662, ...], 'Food and Drug Stores': [6, 16, 18, 86, 106, 159, 180, 594, 613, 630, 668, 755, 808, 848, 927], 'Food, Beverages & Tobacco': [40, 43, 61, 65, 83, 93, 105, 148, 152, 160, 175, 206, 214, 241, 265, 303, 335, 336, 361, 396, 412, 428, 451, 455, 459, 534, 541, 566, 573, 586, 607, 614, 635, 663, 685, 701, 769, 786, 794, 803, 888, 901, 953], 'Health Care': [4, 5, 11, 20, 21, 32, 38, 45, 51, 54, 62, 71, 78, 85, 122, 123, 124, 129, 137, 139, 140, 167, 171, 199, 200, 201, 262, 267, 277, 285, 286, 289, 290, 304, 324, 357, 358, 371, 419, 429, 430, 446, 456, 464, 468, 514, 526, 536, 552, 558, 582, 617, 628, 660, 683, 692, 696, 707, 745, 748, 765, 774, 789, 798, 814, 817, 844, 867, 880, 882, 934, 959, 964, 976, 977], 'Hotels, Resturants & Leisure': [108, 145, 194, 217, 240, 253, 308, 370, 443, 465, 533, 545, 556, 561, 584, 730, 762, 763, 778, 796, 894, 914, 917, 940, 998], 'Household Products': [33, 150, 173, 255, 260, 327, 337, 344, 369, 433, 440, 449, 454, 532, 549, 553, 600, 664, 698, 715, 855, 889, 899, 906, 931, 949, 966, 991], 'Industrials': [10, 58, 74, 92, 96, 127, 133, 147, 210, 223, 359, 376, 395, 411, 418, 538, 543, 595, 621, 622, 629, 644, 654, 657, 665, 673, 689, 756, 781, 788, 805, 812, 822, 830, 831, 834, 840, 846, 865, 866, 872, 886, 941, 946, 963, 999], 'Materials': [125, 126, 169, 243, 250, 302, 320, 340, 355, 372, 374, 382, 416, 417, 425, 434, 445, 479, 488, 513, 517, 576, 585, 615, 616, 619, 624, 627, 636, 638, 640, 659, 666, 686, 690, 750, 773, 792, 856, 884, 910, 981, 985], 'Media': [52, 95, 98, 202, 212, 254, 326, 365, 405, 413, 524, 529, 680, 704, 706, 721, 740, 751, 758, 761, 820, 912, 967, 968, 988], 'Motor Vehicles & Parts': [7, 8, 69, 146, 153, 168, 280, 309, 333, 338, 423, 427, 469, 587, 590, 603, 646, 669, 717, 738, 810, 956, 960, 978], 'Retailing': [0, 14, 27, 37, 46, 70, 88, 102, 110, 131, 135, 138, 142, 144, 176, 179, 190, 195, 196, 227, 233, 236, 237, 239, 257, 266, 268, 279, 292, 296, 298, 301, 329, 341, 345, 360, 364, 373, 378, 379, 392, 414, 426, 438, 494, 499, 501, 510, 511, 516, 522, 581, 591, 601, 606, 609, 620, 642, 643, 647, 656, 674, 688, 720, 747, 770, 772, 806, 811, 823, 824, 826, 839, 875, 893, 898, 921, 936, 939, 972], 'Technology': [2, 17, 19, 24, 30, 35, 50, 53, 76, 109, 112, 132, 149, 156, 157, 163, 172, 193, 218, 219, 229, 232, 283, 294, 299, 307, 312, 330, 384, 385, 399, 407, 408, 421, 450, 461, 463, 486, 490, 503, 504, 507, 512, 518, 523, 531, 542, 551, 562, 564, 583, 588, 592, 593, 611, 631, 633, 637, 648, 658, 672, 675, 677, 681, 687, 699, 724, 732, 735, 752, 759, 768, 777, 804, 829, 833, 841, 853, 863, 870, 887, 890, 892, 895, 903, 904, 905, 908, 911, 913, 918, 926, 930, 942, 943, 945, 955, 969, 970, 974, ...], 'Telecommunications': [9, 12, 36, 115, 158, 186, 291, 332, 398, 442, 460, 495, 525, 618, 785], 'Transportation': [47, 57, 66, 67, 79, 128, 141, 207, 238, 269, 352, 389, 394, 404, 406, 415, 431, 458, 520, 527, 569, 577, 641, 671, 708, 712, 739, 799, 813, 857, 883, 929, 932, 944, 971, 973], 'Wholesalers': [56, 63, 91, 101, 107, 118, 121, 166, 182, 184, 211, 275, 284, 314, 316, 319, 322, 334, 350, 356, 368, 390, 422, 462, 473, 476, 483, 563, 580, 598, 626, 652, 684, 726, 746, 779, 807, 836, 874, 990]}

In [ ]:
sectorGroups.get_group('Aerospace & Defense')

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
23,24,Boeing,Aerospace & Defense,Aerospace and Defense,"Chicago, IL",96114,5176,161400
44,45,United Technologies,Aerospace & Defense,Aerospace and Defense,"Farmington, CT",61047,7608,197200
59,60,Lockheed Martin,Aerospace & Defense,Aerospace and Defense,"Bethesda, MD",46132,3605,126000
87,88,General Dynamics,Aerospace & Defense,Aerospace and Defense,"Falls Church, VA",31469,2965,99900
117,118,Northrop Grumman,Aerospace & Defense,Aerospace and Defense,"Falls Church, VA",23526,1990,65000
119,120,Raytheon,Aerospace & Defense,Aerospace and Defense,"Waltham, MA",23247,2074,61000
208,209,Textron,Aerospace & Defense,Aerospace and Defense,"Providence, RI",13423,697,35000
244,245,L-3 Communications,Aerospace & Defense,Aerospace and Defense,"New York, NY",11554,-240,38000
281,282,Precision Castparts,Aerospace & Defense,Aerospace and Defense,"Portland, OR",10056,1530,30106
377,378,Huntington Ingalls Industries,Aerospace & Defense,Aerospace and Defense,"Newport News, VA",7020,404,35995
388,389,Spirit AeroSystems Holdings,Aerospace & Defense,Aerospace and Defense,"Wichita, KS",6644,789,15200
489,490,Rockwell Collins,Aerospace & Defense,Aerospace and Defense,"Cedar Rapids, IA",5262,686,19500
559,560,Orbital ATK,Aerospace & Defense,Aerospace and Defense,"Dulles, VA",4369,159,12300
604,605,Triumph Group,Aerospace & Defense,Aerospace and Defense,"Berwyn, PA",3889,239,15153
784,785,B/E Aerospace,Aerospace & Defense,Aerospace and Defense,"Wellington, FL",2730,286,10057
787,788,TransDigm Group,Aerospace & Defense,Aerospace and Defense,"Cleveland, OH",2707,447,8200
835,836,Moog,Aerospace & Defense,Aerospace and Defense,"Elma, NY",2526,132,10691
902,903,Curtiss-Wright,Aerospace & Defense,Aerospace and Defense,"Charlotte, NC",2264,146,8400
957,958,Woodward,Aerospace & Defense,Aerospace and Defense,"Fort Collins, CO",2038,182,6955
986,987,Delta Tucker Holdings,Aerospace & Defense,Aerospace and Defense,"McLean, VA",1923,-133,12000

First Value from each Category

In [ ]:
sectorGroups.first()

,Rank,Company,Industry,Location,Revenue,Profits,Employees
Sector,,,,,,,
Aerospace & Defense,24,Boeing,Aerospace and Defense,"Chicago, IL",96114,5176,161400
Apparel,91,Nike,Apparel,"Beaverton, OR",30601,3273,62600
Business Services,144,ManpowerGroup,Temporary Help,"Milwaukee, WI",19330,419,27000
Chemicals,56,Dow Chemical,Chemicals,"Midland, MI",48778,7685,49495
Energy,2,Exxon Mobil,Petroleum Refining,"Irving, TX",246204,16150,75600
Engineering & Construction,155,Fluor,"Engineering, Construction","Irving, TX",18114,413,38758
Financials,4,Berkshire Hathaway,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
Food and Drug Stores,7,CVS Health,Food and Drug Stores,"Woonsocket, RI",153290,5237,199000
"Food, Beverages & Tobacco",41,Archer Daniels Midland,Food Production,"Chicago, IL",67702,1849,32300
Health Care,5,McKesson,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
"Hotels, Resturants & Leisure",109,McDonald’s,Food Services,"Oak Brook, IL",25413,4529,420000
Household Products,34,Procter & Gamble,Household and Personal Products,"Cincinnati, OH",78756,7036,110000
Industrials,11,General Electric,Industrial Machinery,"Fairfield, CT",140389,-6126,333000
Materials,126,Alcoa,Metals,"New York, NY",22534,-322,60000
Media,53,Disney,Entertainment,"Burbank, CA",52465,8382,185000
Motor Vehicles & Parts,8,General Motors,Motor Vehicles and Parts,"Detroit, MI",152356,9687,215000
Retailing,1,Walmart,General Merchandisers,"Bentonville, AR",482130,14694,2300000
Technology,3,Apple,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
Telecommunications,10,AT&T,Telecommunications,"Dallas, TX",146801,13345,281450
Transportation,48,UPS,"Mail, Package, and Freight Delivery","Atlanta, GA",58363,4844,341240
Wholesalers,57,Sysco,Wholesalers: Food and Grocery,"Houston, TX",48681,687,51700

Last Value from each Category

In [ ]:
sectorGroups.last()

,Rank,Company,Industry,Location,Revenue,Profits,Employees
Sector,,,,,,,
Aerospace & Defense,987,Delta Tucker Holdings,Aerospace and Defense,"McLean, VA",1923,-133,12000
Apparel,917,Guess,Apparel,"Los Angeles, CA",2204,82,13500
Business Services,993,DeVry Education Group,Education,"Downers Grove, IL",1910,140,11770
Chemicals,949,H.B. Fuller,Chemicals,"St. Paul, MN",2084,87,4425
Energy,997,Portland General Electric,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
Engineering & Construction,994,MDC Holdings,Homebuilders,"Denver, CO",1909,66,1225
Financials,996,New York Community Bancorp,Commercial Banks,"Westbury, NY",1902,-47,3448
Food and Drug Stores,928,Fred’s,Food and Drug Stores,"Memphis, TN",2151,-7,7103
"Food, Beverages & Tobacco",954,Alliance One International,Tobacco,"Morrisville, NC",2066,-15,6835
Health Care,978,Providence Service,Health Care: Pharmacy and Other Services,"Tucson, AZ",1987,84,9072
"Hotels, Resturants & Leisure",999,Wendy’s,Food Services,"Dublin, OH",1896,161,21200
Household Products,992,Revlon,Household and Personal Products,"New York, NY",1914,56,5700
Industrials,1000,Briggs & Stratton,Industrial Machinery,"Wauwatosa, WI",1895,46,5480
Materials,986,Schnitzer Steel Industries,Metals,"Portland, OR",1924,-197,2955
Media,989,Cenveo,"Publishing, Printing","Stamford, CT",1921,-31,7300
Motor Vehicles & Parts,979,Allison Transmission Holdings,Motor Vehicles and Parts,"Indianaoplis, IN",1986,182,2700
Retailing,973,99 Cents Only Stores,Specialty Retailers: Other,"Commerce, CA",1999,-232,18200
Technology,990,F5 Networks,Network and Other Communications Equipment,"Seattle, WA",1920,365,4178
Telecommunications,786,Equinix,Telecommunications,"Redwood City, CA",2726,188,5042
Transportation,974,Roadrunner Transportation Systems,Transportation and Logistics,"Cudahy, WI",1995,48,4502
Wholesalers,991,BlueLinx Holdings,Wholesalers: Diversified,"Atlanta, GA",1917,-12,1600

- Max profit for Energy Sector

In [ ]:
sectorGroups.get_group('Energy')['Profits'].agg('max')

16150

- Avg employees for Advertising,marketing

In [ ]:
df[df['Industry'] == 'Advertising, marketing']['Employees'].mean()

62050.0

In [ ]:
df.groupby(by='Industry').get_group('Advertising, marketing')['Employees'].agg('mean')

62050.0

In [ ]:
sectorGroups['Profits'].max().get('Energy')

16150

In [ ]:
sectorNew = df.groupby(['Sector','Industry'])

To see the Group By Data

In [ ]:
sectorNew.groups

{('Aerospace & Defense', 'Aerospace and Defense'): [23, 44, 59, 87, 117, 119, 208, 244, 281, 377, 388, 489, 559, 604, 784, 787, 835, 902, 957, 986], ('Apparel', 'Apparel'): [90, 230, 339, 353, 447, 546, 574, 596, 682, 694, 725, 793, 876, 881, 916], ('Business Services', 'Advertising, marketing'): [185, 354], ('Business Services', 'Diversified Outsourcing Services'): [198, 247, 484, 544, 625, 634, 713, 728, 743, 782, 802, 815, 818, 868], ('Business Services', 'Education'): [736, 819, 992], ('Business Services', 'Financial Data Services'): [203, 248, 293, 306, 391, 403, 467, 480, 491, 651, 693, 766, 775, 776, 791, 795, 800, 885, 951], ('Business Services', 'Miscellaneous'): [439, 733, 869], ('Business Services', 'Temporary Help'): [143, 466, 502, 790, 950], ('Business Services', 'Waste Management'): [220, 311, 676, 734, 938], ('Chemicals', 'Chemicals'): [55, 100, 181, 188, 205, 252, 261, 276, 287, 295, 315, 537, 548, 554, 565, 579, 612, 623, 653, 667, 716, 719, 723, 757, 760, 828, 864, 897, 933, 948], ('Energy', 'Energy'): [192, 363, 383, 401, 474, 557, 605, 632, 741, 783, 801, 809, 878, 961], ('Energy', 'Mining, Crude-Oil Production'): [89, 174, 215, 222, 224, 321, 323, 348, 387, 437, 457, 521, 597, 661, 702, 703, 705, 742, 753, 797, 825, 859, 861, 900, 954, 965, 980, 994], ('Energy', 'Miscellaneous'): [695], ('Energy', 'Oil and Gas Equipment, Services'): [116, 177, 191, 318, 409, 540, 691, 714, 771], ('Energy', 'Petroleum Refining'): [1, 13, 29, 31, 41, 97, 213, 216, 288, 393, 444, 568, 570, 731, 849, 952, 982], ('Energy', 'Pipelines'): [64, 103, 120, 197, 347, 386, 492, 655, 858, 907, 923, 947], ('Energy', 'Utilities: Gas and Electric'): [94, 114, 161, 162, 164, 165, 187, 189, 228, 242, 245, 246, 256, 271, 273, 278, 342, 349, 362, 402, 424, 436, 482, 506, 547, 555, 578, 599, 649, 678, 710, 744, 816, 842, 850, 852, 854, 920, 979, 996, 997], ('Engineering & Construction', 'Engineering, Construction'): [154, 155, 234, 313, 351, 380, 477, 500, 515, 571, 873, 891, 962, 984], ('Engineering & Construction', 'Homebuilders'): [259, 300, 432, 497, 575, 639, 718, 737, 821, 862, 928, 993], ('Financials', 'Commercial Banks'): [22, 25, 26, 28, 73, 77, 111, 130, 170, 178, 263, 272, 282, 328, 375, 452, 453, 485, 509, 519, 539, 602, 697, 764, 915, 937, 975, 995], ('Financials', 'Diversified Financials'): [15, 42, 82, 84, 183, 221, 231, 251, 297, 470, 493, 535, 711, 879, 922], ('Financials', 'Insurance: Life, Health (Mutual)'): [60, 75, 81, 99, 225, 317, 478, 843, 851, 924], ('Financials', 'Insurance: Life, Health (stock)'): [39, 49, 134, 204, 235, 264, 270, 305, 325, 366, 550, 589, 610, 700, 722, 749, 896, 925], ('Financials', 'Insurance: Property and Casualty (Mutual)'): [34, 68, 226, 397, 645, 754, 909], ('Financials', 'Insurance: Property and Casualty (Stock)'): [3, 48, 72, 80, 104, 113, 136, 151, 209, 274, 310, 331, 367, 410, 420, 441, 475, 496, 498, 505, 508, 530, 560, 727, 837, 877, 935, 958], ('Financials', 'Real estate'): [258, 435, 448, 471, 472, 487, 608, 650, 780, 827, 832, 845, 860, 919, 987], ('Financials', 'Securities'): [249, 343, 346, 381, 400, 481, 528, 567, 572, 662, 670, 679, 709, 729, 767, 838, 847, 871], ('Food and Drug Stores', 'Food and Drug Stores'): [6, 16, 18, 86, 106, 159, 180, 594, 613, 630, 668, 755, 808, 848, 927], ('Food, Beverages & Tobacco', 'Beverages'): [61, 396, 412, 428, 541, 635, 701, 786, 888], ('Food, Beverages & Tobacco', 'Food Consumer Products'): [43, 93, 152, 160, 175, 206, 214, 303, 335, 336, 361, 451, 534, 566, 586, 607, 614, 685, 794, 803], ('Food, Beverages & Tobacco', 'Food Production'): [40, 65, 83, 241, 455, 459, 573, 663, 769], ('Food, Beverages & Tobacco', 'Tobacco'): [105, 148, 265, 901, 953], ('Health Care', 'Health Care: Insurance and Managed Care'): [5, 32, 45, 51, 78, 123, 171, 200, 201, 536, 748], ('Health Care', 'Health Care: Medical Facilities'): [62, 124, 139, 199, 289, 371, 429, 456, 514, 617, 692, 696, 765, 934], ('Health Care', 'Health Care: Pharmacy and Other Services'): [21, 324, 357, 446, 468, 552, 628, 745, 774, 880, 882, 959, 977], ('Health Care', 'Medical Products and Equipment'): [137, 277, 285, 286, 358, 430, 464, 660, 707, 789, 798, 817, 844, 867, 964, 976], ('Health Care', 'Pharmaceuticals'): [38, 54, 71, 85, 122, 129, 140, 167, 262, 304, 419, 526, 582, 683, 814], ('Health Care', 'Wholesalers: Health Care'): [4, 11, 20, 267, 290, 558], ('Hotels, Resturants & Leisure', 'Food Services'): [108, 145, 217, 370, 545, 556, 730, 762, 796, 914, 940, 998], ('Hotels, Resturants & Leisure', 'Hotels, Casinos, Resorts'): [194, 240, 253, 308, 443, 465, 533, 561, 584, 763, 778, 894, 917], ('Household Products', 'Home Equipment, Furnishings'): [255, 327, 337, 344, 433, 532, 600, 698, 715, 889, 931, 966], ('Household Products', 'Household and Personal Products'): [33, 150, 173, 260, 369, 440, 454, 553, 664, 855, 899, 906, 991], ('Household Products', 'Miscellaneous'): [449, 549, 949], ('Industrials', 'Construction and Farm Machinery'): [58, 96, 147, 359, 395, 657, 689, 812, 865], ('Industrials', 'Electronics, Electrical Equip.'): [74, 127, 133, 411, 418, 543, 622, 644, 665, 788, 830, 840, 886], ('Industrials', 'Industrial Machinery'): [10, 210, 223, 376, 538, 595, 621, 629, 654, 673, 756, 781, 805, 822, 831, 834, 846, 866, 872, 941, 946, 963, 999], ('Industrials', 'Miscellaneous'): [92], ('Materials', 'Building Materials, Glass'): [479, 615, 636, 638, 640, 659, 856], ('Materials', 'Forest and Paper Products'): [372, 488, 624, 750, 792], ('Materials', 'Metals'): [125, 169, 243, 302, 355, 382, 416, 619, 666, 686, 690, 910, 981, 985], ('Materials', 'Miscellaneous'): [425], ('Materials', 'Packaging, Containers'): [126, 250, 320, 340, 374, 417, 434, 445, 513, 517, 576, 585, 616, 627, 773, 884], ('Media', 'Entertainment'): [52, 95, 98, 202, 212, 365, 405, 413, 524, 680, 704, 721, 740, 758, 761, 820, 912, 968], ('Media', 'Publishing, Printing'): [254, 326, 529, 706, 751, 967, 988], ('Motor Vehicles & Parts', 'Motor Vehicles and Parts'): [7, 8, 69, 146, 153, 168, 280, 309, 333, 338, 423, 427, 469, 587, 590, 603, 646, 669, 717, 738, 810, 956, 960, 978], ('Retailing', 'Automotive Retailing, Services'): [135, 142, 190, 266, 268, 296, 329, 345, 392, 510], ('Retailing', 'General Merchandisers'): [0, 37, 102, 110, 138, 144, 196, 227, 379, 772], ('Retailing', 'Specialty Retailers: Apparel'): [88, 176, 233, 236, 360, 499, 501, 522, 642, 643, 647, 656, 720, 806, 811, 823, 839, 875], ('Retailing', 'Specialty Retailers: Other'): [14, 27, 46, 70, 131, 179, 195, 237, 239, 257, 279, 292, 298, 301, 341, 364, 373, 378, 414, 426, 438, 494, 511, 516, 581, 591, 601, 606, 609, 620, 674, 688, 747, 770, 824, 826, 893, 898, 921, 936, 939, 972], ('Technology', 'Computer Peripherals'): [112, 193, 421, 637], ('Technology', 'Computer Software'): [24, 76, 385, 399, 523, 531, 542, 551, 562, 833, 841, 908, 918, 983], ('Technology', 'Computers, Office Equipment'): [2, 19, 408, 633, 777, 970, 974], ('Technology', 'Information Technology Services'): [30, 149, 219, 229, 232, 486, 503, 564, 672, 724, 926, 942, 945], ('Technology', 'Internet Services and Retailing'): [17, 35, 156, 283, 299, 307, 384, 512, 681, 687, 732, 735, 905, 913, 969], ('Technology', 'Network and Other Communications Equipment'): [53, 109, 312, 450, 461, 504, 518, 583, 611, 675, 699, 853, 903, 989], ('Technology', 'Scientific,Photographic and Control Equipment'): [132, 163, 588, 593, 631, 759, 863, 892, 895, 904, 911, 955], ('Technology', 'Semiconductors and Other Electronic Components'): [50, 157, 172, 218, 294, 330, 407, 463, 490, 507, 592, 648, 658, 677, 752, 768, 804, 829, 870, 887, 890, 930, 943], ('Telecommunications', 'Telecommunications'): [9, 12, 36, 115, 158, 186, 291, 332, 398, 442, 460, 495, 525, 618, 785], ('Transportation', 'Airlines'): [66, 67, 79, 141, 404, 458, 708, 883, 932], ('Transportation', 'Mail, Package, and Freight Delivery'): [47, 57], ('Transportation', 'Miscellaneous'): [929], ('Transportation', 'Railroads'): [128, 238, 269, 857, 971], ('Transportation', 'Transportation Equipment'): [406, 431, 527, 577, 813], ('Transportation', 'Transportation and Logistics'): [207, 352, 389, 641, 973], ('Transportation', 'Trucking, Truck Leasing'): [394, 415, 520, 569, 671, 712, 739, 799, 944], ('Wholesalers', 'Miscellaneous'): [314], ('Wholesalers', 'Wholesalers: Diversified'): [91, 166, 182, 275, 284, 319, 322, 356, 368, 390, 422, 462, 483, 563, 580, 598, 626, 652, 726, 746, 779, 807, 836, 874, 990], ('Wholesalers', 'Wholesalers: Electronics and Office Equipment'): [63, 101, 107, 118, 211, 473, 476, 684], ('Wholesalers', 'Wholesalers: Food and Grocery'): [56, 121, 184, 316, 334, 350]}

In [ ]:
sectorNew.get_group(('Energy', 'Petroleum Refining'))

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
13,14,Chevron,Energy,Petroleum Refining,"San Ramon, CA",131118,4587,61500
29,30,Phillips 66,Energy,Petroleum Refining,"Houston, TX",87169,4227,14000
31,32,Valero Energy,Energy,Petroleum Refining,"San Antonio, TX",81824,3990,10103
41,42,Marathon Petroleum,Energy,Petroleum Refining,"Findlay, OH",64566,2852,45440
97,98,Tesoro,Energy,Petroleum Refining,"San Antonio, TX",28150,1540,6016
213,214,HollyFrontier,Energy,Petroleum Refining,"Dallas, TX",13238,740,2704
216,217,PBF Energy,Energy,Petroleum Refining,"Parsippany, NJ",13124,146,2270
288,289,Western Refining,Energy,Petroleum Refining,"El Paso, TX",9787,407,7347
393,394,Hess,Energy,Petroleum Refining,"New York, NY",6575,-3056,2770
444,445,Delek US Holdings,Energy,Petroleum Refining,"Brentwood, TN",5762,19,4584
568,569,Alon USA Energy,Energy,Petroleum Refining,"Dallas, TX",4260,53,2860
570,571,Calumet Specialty Products Partners,Energy,Petroleum Refining,"Indianapolis, IN",4213,-139,2175
731,732,Northern Tier Energy,Energy,Petroleum Refining,"Tempe, AZ",3002,331,2961
849,850,United Refining,Energy,Petroleum Refining,"Warren, PA",2470,82,2997
952,953,Par Pacific Holdings,Energy,Petroleum Refining,"Houston, TX",2066,-40,744
982,983,Adams Resources & Energy,Energy,Petroleum Refining,"Houston, TX",1944,-1,809

In [ ]:
sectorNew.agg(['min', 'max', 'mean'])

C:\Users\Miles\AppData\Local\Temp\ipykernel_3924\765127957.py:1: FutureWarning: ['Company', 'Location'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  sectorNew.agg(['min', 'max', 'mean'])

                                                                  Rank       \
                                                                   min  max
Sector              Industry
Aerospace & Defense Aerospace and Defense                           24  987
Apparel             Apparel                                         91  917
Business Services   Advertising, marketing                         186  355
                    Diversified Outsourcing Services               199  869
                    Education                                      737  993
...                                                                ...  ...
Transportation      Trucking, Truck Leasing                        395  945
Wholesalers         Miscellaneous                                  315  315
                    Wholesalers: Diversified                        92  991
                    Wholesalers: Electronics and Office Equipment   64  685
                    Wholesalers: Food and Grocery                   57  351

                                                                               \
                                                                         mean
Sector              Industry
Aerospace & Defense Aerospace and Defense                          443.500000
Apparel             Apparel                                        583.800000
Business Services   Advertising, marketing                         270.500000
                    Diversified Outsourcing Services               643.928571
                    Education                                      850.000000
...                                                                       ...
Transportation      Trucking, Truck Leasing                        641.333333
Wholesalers         Miscellaneous                                  315.000000
                    Wholesalers: Diversified                       516.880000
                    Wholesalers: Electronics and Office Equipment  280.125000
                    Wholesalers: Food and Grocery                  227.833333

                                                                  Revenue  \
                                                                      min
Sector              Industry
Aerospace & Defense Aerospace and Defense                            1923
Apparel             Apparel                                          2204
Business Services   Advertising, marketing                           7614
                    Diversified Outsourcing Services                 2383
                    Education                                        1910
...                                                                   ...
Transportation      Trucking, Truck Leasing                          2094
Wholesalers         Miscellaneous                                    8982
                    Wholesalers: Diversified                         1917
                    Wholesalers: Electronics and Office Equipment    3219
                    Wholesalers: Food and Grocery                    7652

                                                                          \
                                                                     max
Sector              Industry
Aerospace & Defense Aerospace and Defense                          96114
Apparel             Apparel                                        30601
Business Services   Advertising, marketing                         15134
                    Diversified Outsourcing Services               14329
                    Education                                       2984
...                                                                  ...
Transportation      Trucking, Truck Leasing                         6572
Wholesalers         Miscellaneous                                   8982
                    Wholesalers: Diversified                       30380
                    Wholesalers: Electronics and Office Equipment  43026
                    Wholesalers: Food and Grocery                  48681

                                                                                 \
                                                                           mean
Sector              Industry
Aerospace & Defense Aerospace and Defense                          17897.000000
Apparel             Apparel                                         6397.866667
Business Services   Advertising, marketing                         11374.000000
                    Diversified Outsourcing Services                4630.642857
                    Education                                       2495.000000
...                                                                         ...
Transportation      Trucking, Truck Leasing                         3994.444444
Wholesalers         Miscellaneous                                   8982.000000
                    Wholesalers: Diversified                        7045.520000
                    Wholesalers: Electronics and Office Equipment  18488.250000
                    Wholesalers: Food and Grocery                  18629.000000

                                                                  Profits  \
                                                                      min
Sector              Industry
Aerospace & Defense Aerospace and Defense                            -240
Apparel             Apparel                                            82
Business Services   Advertising, marketing                            455
                    Diversified Outsourcing Services                  -12
                    Education                                        -101
...                                                                   ...
Transportation      Trucking, Truck Leasing                             1
Wholesalers         Miscellaneous                                      17
                    Wholesalers: Diversified                         -502
                    Wholesalers: Electronics and Office Equipment     -44
                    Wholesalers: Food and Grocery                      52

                                                                         \
                                                                    max
Sector              Industry
Aerospace & Defense Aerospace and Defense                          7608
Apparel             Apparel                                        3273
Business Services   Advertising, marketing                         1094
                    Diversified Outsourcing Services               1453
                    Education                                       140
...                                                                 ...
Transportation      Trucking, Truck Leasing                         427
Wholesalers         Miscellaneous                                    17
                    Wholesalers: Diversified                       1472
                    Wholesalers: Electronics and Office Equipment   572
                    Wholesalers: Food and Grocery                   687

                                                                                \
                                                                          mean
Sector              Industry
Aerospace & Defense Aerospace and Defense                          1437.100000
Apparel             Apparel                                         549.066667
Business Services   Advertising, marketing                          774.500000
                    Diversified Outsourcing Services                307.500000
                    Education                                        23.000000
...                                                                        ...
Transportation      Trucking, Truck Leasing                         212.222222
Wholesalers         Miscellaneous                                    17.000000
                    Wholesalers: Diversified                        207.720000
                    Wholesalers: Electronics and Office Equipment   232.125000
                    Wholesalers: Food and Grocery                   194.333333

                                                                  Employees  \
                                                                        min
Sector              Industry
Aerospace & Defense Aerospace and Defense                              6955
Apparel             Apparel                                            5978
Business Services   Advertising, marketing                            49200
                    Diversified Outsourcing Services                   2400
                    Education                                         11585
...                                                                     ...
Transportation      Trucking, Truck Leasing                            1223
Wholesalers         Miscellaneous                                      9200
                    Wholesalers: Diversified                            500
                    Wholesalers: Electronics and Office Equipment      2000
                    Wholesalers: Food and Grocery                      6655

                                                                           \
                                                                      max
Sector              Industry
Aerospace & Defense Aerospace and Defense                          197200
Apparel             Apparel                                         65300
Business Services   Advertising, marketing                          74900
                    Diversified Outsourcing Services               216500
                    Education                                       23400
...                                                                   ...
Transportation      Trucking, Truck Leasing                         33100
Wholesalers         Miscellaneous                                    9200
                    Wholesalers: Diversified                        39600
                    Wholesalers: Electronics and Office Equipment   78500
                    Wholesalers: Food and Grocery                   51700


                                                                           mean
Sector              Industry
Aerospace & Defense Aerospace and Defense                          48402.850000
Apparel             Apparel                                        23093.133333
Business Services   Advertising, marketing                         62050.000000
                    Diversified Outsourcing Services               50595.000000
                    Education                                      15585.000000
...                                                                         ...
Transportation      Trucking, Truck Leasing                        18939.555556
Wholesalers         Miscellaneous                                   9200.000000
                    Wholesalers: Diversified                        9353.240000
                    Wholesalers: Electronics and Office Equipment  20832.625000
                    Wholesalers: Food and Grocery                  19317.500000

[79 rows x 12 columns]

In [ ]:
sectorNew.agg({'Revenue':'sum', 'Profits':'mean'})

                                                                   Revenue  \
Sector              Industry
Aerospace & Defense Aerospace and Defense                           357940
Apparel             Apparel                                          95968
Business Services   Advertising, marketing                           22748
                    Diversified Outsourcing Services                 64829
                    Education                                         7485
...                                                                    ...
Transportation      Trucking, Truck Leasing                          35950
Wholesalers         Miscellaneous                                     8982
                    Wholesalers: Diversified                        176138
                    Wholesalers: Electronics and Office Equipment   147906
                    Wholesalers: Food and Grocery                   111774

                                                                       Profits
Sector              Industry
Aerospace & Defense Aerospace and Defense                          1437.100000
Apparel             Apparel                                         549.066667
Business Services   Advertising, marketing                          774.500000
                    Diversified Outsourcing Services                307.500000
                    Education                                        23.000000
...                                                                        ...
Transportation      Trucking, Truck Leasing                         212.222222
Wholesalers         Miscellaneous                                    17.000000
                    Wholesalers: Diversified                        207.720000
                    Wholesalers: Electronics and Office Equipment   232.125000
                    Wholesalers: Food and Grocery                   194.333333

[79 rows x 2 columns]

DataFrame Concat

In [ ]:
pd.concat([df,df2], ignore_index=True)

,Rank,Company,Sector,Industry,Location,Revenue,Profits,Employees
0,1,Walmart,Retailing,General Merchandisers,"Bentonville, AR",482130,14694,2300000
1,2,Exxon Mobil,Energy,Petroleum Refining,"Irving, TX",246204,16150,75600
2,3,Apple,Technology,"Computers, Office Equipment","Cupertino, CA",233715,53394,110000
3,4,Berkshire Hathaway,Financials,Insurance: Property and Casualty (Stock),"Omaha, NE",210821,24083,331000
4,5,McKesson,Health Care,Wholesalers: Health Care,"San Francisco, CA",181241,1476,70400
...,...,...,...,...,...,...,...,...
1995,996,New York Community Bancorp,Financials,Commercial Banks,"Westbury, NY",1902,-47,3448
1996,997,Portland General Electric,Energy,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
1997,997,Portland General Electric,Energy,Utilities: Gas and Electric,"Portland, OR",1898,172,2646
1998,999,Wendy’s,"Hotels, Resturants & Leisure",Food Services,"Dublin, OH",1896,161,21200
1999,1000,Briggs & Stratton,Industrials,Industrial Machinery,"Wauwatosa, WI",1895,46,5480

In [ ]:
df.merge(df2, how='inner', on='Company')

NameError: name 'df2' is not defined

In [ ]:
df = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\movielens.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\Miles\\Documents\\Futurense\\Python\\Datasets\\movielens.csv'

- create a df, ratings & movies
- change DataType
- perfom inner join on both to extract - userId, MovieId and MovieName

In [ ]:
dfMovies = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\movies.csv')
dfRatings = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\ratings.csv')
dfLinks = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\links.csv')
dfTags = pd.read_csv(r'C:\Users\Miles\Documents\Futurense\Python\Datasets\tags.csv')

In [ ]:
dfMovies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

In [ ]:
dfRatings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [ ]:
dfRatings.merge(dfMovies, how='inner', on='movieId')[['userId','movieId','title']]

        userId  movieId                             title
0            1        1                  Toy Story (1995)
1            5        1                  Toy Story (1995)
2            7        1                  Toy Story (1995)
3           15        1                  Toy Story (1995)
4           17        1                  Toy Story (1995)
...        ...      ...                               ...
100831     610   160341                  Bloodmoon (1997)
100832     610   160527  Sympathy for the Underdog (1971)
100833     610   160836                     Hazard (2005)
100834     610   163937                Blair Witch (2016)
100835     610   163981                         31 (2016)

[100836 rows x 3 columns]

In [ ]:
dfRatings=dfRatings.rename(columns={'movieId':'movie_id'})
pd.merge()

TypeError: merge() missing 2 required positional arguments: 'left' and 'right'

In [ ]:
dfRatings.merge(dfMovies,left_on='movie_id',right_on='movieId',how='inner')[['userId','movieId','title']]

        userId  movieId                             title
0            1        1                  Toy Story (1995)
1            5        1                  Toy Story (1995)
2            7        1                  Toy Story (1995)
3           15        1                  Toy Story (1995)
4           17        1                  Toy Story (1995)
...        ...      ...                               ...
100831     610   160341                  Bloodmoon (1997)
100832     610   160527  Sympathy for the Underdog (1971)
100833     610   160836                     Hazard (2005)
100834     610   163937                Blair Witch (2016)
100835     610   163981                         31 (2016)

[100836 rows x 3 columns]

In [ ]:
dfRatings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movie_id   100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [ ]:
dfRatings.merge(dfTags,left_on=['userId','movie_id'],right_on=['userId','movieId'],how='inner')[['userId','movie_id','tag']]

      userId  movie_id               tag
0          2     60756             funny
1          2     60756   Highly quotable
2          2     60756      will ferrell
3          2     89774      Boxing story
4          2     89774               MMA
...      ...       ...               ...
3471     606      6107      World War II
3472     606      7382         for katie
3473     610      3265            gun fu
3474     610      3265  heroic bloodshed
3475     610    168248  Heroic Bloodshed

[3476 rows x 3 columns]

In [ ]:
dfRatings.merge(dfTags,left_on=['userId','movie_id'],right_on=['userId','movieId'],how='inner').merge(dfMovies,left_on='movie_id',right_on='movieId', how='inner')[['userId','movie_id','rating','tag','title']]

,userId,movie_id,rating,tag,title
0,2,60756,5.0,funny,Step Brothers (2008)
1,2,60756,5.0,Highly quotable,Step Brothers (2008)
2,2,60756,5.0,will ferrell,Step Brothers (2008)
3,62,60756,3.5,comedy,Step Brothers (2008)
4,62,60756,3.5,funny,Step Brothers (2008)
...,...,...,...,...,...
3471,606,1948,3.5,British,Tom Jones (1963)
3472,606,5694,3.0,70mm,Staying Alive (1983)
3473,606,6107,4.0,World War II,Night of the Shooting Stars (Notte di San Lore...
3474,610,3265,5.0,gun fu,Hard-Boiled (Lat sau san taam) (1992)
3475,610,3265,5.0,heroic bloodshed,Hard-Boiled (Lat sau san taam) (1992)

In [ ]:
dfRatings.merge(dfTags,left_on=['userId','movie_id'],right_on=['userId','movieId'],how='outer',suffixes=['1','2'])[['userId','movie_id','rating','tag']]

        userId  movie_id  rating          tag
0            1       1.0     4.0          NaN
1            1       3.0     4.0          NaN
2            1       6.0     4.0          NaN
3            1      47.0     5.0          NaN
4            1      50.0     5.0          NaN
...        ...       ...     ...          ...
102879     573       NaN     NaN     not seen
102880     573       NaN     NaN          bad
102881     573       NaN     NaN  Ben Affleck
102882     600       NaN     NaN       gothic
102883     606       NaN     NaN      austere

[102884 rows x 4 columns]

Time Series

In [23]:
import datetime as dt

from pandas_datareader import data

In [24]:
time1=dt.datetime(2011,9,21)

In [25]:
str(dt.datetime(2011,9,21))

'2011-09-21 00:00:00'

In [26]:
time1.year

2011

In [27]:
pd.Timestamp('2012-Oct-2')

Timestamp('2012-10-02 00:00:00')

In [28]:
pd.Timestamp('2-3-2012')

Timestamp('2012-02-03 00:00:00')

In [29]:
pd.date_range('2023-02-1','2023-02-28', freq='2D')

DatetimeIndex(['2023-02-01', '2023-02-03', '2023-02-05', '2023-02-07',
               '2023-02-09', '2023-02-11', '2023-02-13', '2023-02-15',
               '2023-02-17', '2023-02-19', '2023-02-21', '2023-02-23',
               '2023-02-25', '2023-02-27'],
              dtype='datetime64[ns]', freq='2D')

In [30]:
pd.date_range('2023-02-1','2023-02-28', freq='M')

DatetimeIndex(['2023-02-28'], dtype='datetime64[ns]', freq='M')

In [31]:
pd.date_range('2023-02-1','2023-02-28', freq='B')

DatetimeIndex(['2023-02-01', '2023-02-02', '2023-02-03', '2023-02-06',
               '2023-02-07', '2023-02-08', '2023-02-09', '2023-02-10',
               '2023-02-13', '2023-02-14', '2023-02-15', '2023-02-16',
               '2023-02-17', '2023-02-20', '2023-02-21', '2023-02-22',
               '2023-02-23', '2023-02-24', '2023-02-27', '2023-02-28'],
              dtype='datetime64[ns]', freq='B')

In [32]:
dateSeries = pd.Series(pd.date_range('2023-01-1','2023-03-26', freq='15D'))

In [33]:
dateSeries.dt.day_of_week

0    6
1    0
2    1
3    2
4    3
5    4
dtype: int64

In [34]:
stocks = data.DataReader(name='MSFT',data_source='stooq',start='2022-01-01', end='2023-01-01')

In [35]:
stocks.head()

              Open    High       Low   Close      Volume
Date
2022-12-30  238.21  239.96  236.6600  239.82  21938472.0
2022-12-29  235.65  241.92  235.6500  241.01  19770693.0
2022-12-28  236.89  239.72  234.1700  234.53  17457104.0
2022-12-27  238.70  238.93  235.8300  236.96  16688648.0
2022-12-23  236.11  238.87  233.9428  238.73  21206982.0

Q.
- Find the Total amount of Volume of Share that has been trade from Monday to Wednesday
- Get the Highest Value of the stock which has been placed in each year
- Find the minimum closing values of each quarter in the year 2022

In [36]:
stocks[stocks['Date'].dt.day_of_week.isin([0, 1, 2])]['Volume'].sum()

KeyError: 'Date'

In [ ]:
stocksDate=stocks.groupby(by='Date')

In [ ]:
stocks['quarter']=stocks['Date'].dt.quarter

In [ ]:
stocksQuarter=stocks.groupby(by='quarter')

3rd Question

In [ ]:
stocksQuarter.agg('min')

              Date     Open     High      Low    Close        Volume
quarter
1       2022-01-03  270.539  281.906  268.047  273.854  2.273090e+07
2       2022-04-01  242.659  244.530  240.321  241.068  1.745828e+07
3       2022-07-01  236.145  239.276  232.076  232.245  1.663014e+07
4       2022-10-03  216.939  219.791  212.831  213.648  9.200772e+06

Time Delta

In [ ]:
# Create two dates
start_date = pd.to_datetime("2022-01-01")
end_date = pd.to_datetime("2022-01-15")

# Calculate the time delta between the two dates
time_delta = end_date - start_date
time_delta
# Result:
# Timedelta('14 days 00:00:00')

Timedelta('14 days 00:00:00')

Date Offset

In [ ]:
from pandas.tseries.offsets import DateOffset
DateOffset()

In [ ]:
ts = pd.Timestamp('2017-01-01 09:10:11')

ts + DateOffset(months=3)

# Timestamp('2017-04-01 09:10:11')

Timestamp('2017-04-01 09:10:11')

In [ ]:
stocks['Date']

0     2022-12-30
1     2022-12-29
2     2022-12-28
3     2022-12-27
4     2022-12-23
         ...
246   2022-01-07
247   2022-01-06
248   2022-01-05
249   2022-01-04
250   2022-01-03
Name: Date, Length: 251, dtype: datetime64[ns]

In [ ]:
stocks['Date'] + DateOffset(days=2)

stocks['Date'] + DateOffset(month=2)

C:\Users\Miles\AppData\Local\Temp\ipykernel_28268\896185638.py:3: PerformanceWarning: Non-vectorized DateOffset being applied to Series or DatetimeIndex.
  stocks['Date'] + DateOffset(month=2)

0     2022-02-28
1     2022-02-28
2     2022-02-28
3     2022-02-27
4     2022-02-23
         ...
246   2022-02-07
247   2022-02-06
248   2022-02-05
249   2022-02-04
250   2022-02-03
Name: Date, Length: 251, dtype: datetime64[ns]

In [ ]:
stocks['Date'].get(5)

Timestamp('2022-12-22 00:00:00')

In [53]:
stocks.iloc[:3]

              Open    High     Low   Close      Volume
Date
2022-12-30  238.21  239.96  236.66  239.82  21938472.0
2022-12-29  235.65  241.92  235.65  241.01  19770693.0
2022-12-28  236.89  239.72  234.17  234.53  17457104.0

In [56]:
stocks.index[0:3]

DatetimeIndex(['2022-12-30', '2022-12-29', '2022-12-28'], dtype='datetime64[ns]', name='Date', freq=None)